AlexLeeChan/esp32template/esp32template v1.ino
/*
  ESP32(x) Control Template - OPTIMIZED OTA VERSION
  Features: RTOS, BLE control, WiFi config, Task monitoring, Reliable OTA over WEB
*/

#define DEBUG_MODE 1
#define ENABLE_OTA 1

// FreeRTOS runtime stats configuration
#ifndef CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS
#define CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS 1
#endif
#ifndef CONFIG_FREERTOS_USE_CUSTOM_RUN_TIME_STATS_HOOKS
#define CONFIG_FREERTOS_USE_CUSTOM_RUN_TIME_STATS_HOOKS 1
#endif
#ifndef CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS
#define CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS 1
#endif
#ifndef CONFIG_FREERTOS_USE_TRACE_FACILITY
#define CONFIG_FREERTOS_USE_TRACE_FACILITY 1
#endif

#define portCONFIGURE_TIMER_FOR_RUN_TIME_STATS configureTimerForRunTimeStats
#define portGET_RUN_TIME_COUNTER_VALUE ulGetRunTimeCounterValue

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include "esp_freertos_hooks.h"
#include "esp_task_wdt.h"
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <esp_wifi.h>
#include <esp_timer.h>
#include <esp_log.h>
#include <pgmspace.h>
#if ENABLE_OTA
#include <Update.h>
#include <esp_ota_ops.h>
#include <WiFiClientSecure.h>
#include <HTTPClient.h>
#include "esp_partition.h"
#endif

// Target chip detection
#if defined(CONFIG_IDF_TARGET_ESP32)
#define ESP32_HAS_BLE 1
#define BLE_ADVERT_NAME "RNGDS_ESP32"
#define ESP32_HAS_TEMP 0
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
#define ESP32_HAS_BLE 1
#define BLE_ADVERT_NAME "RNGDS_ESP32S3"
#define ESP32_HAS_TEMP 1
#include "driver/temperature_sensor.h"
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
#define ESP32_HAS_BLE 1
#define BLE_ADVERT_NAME "RNGDS_ESP32C3"
#define ESP32_HAS_TEMP 1
#include "driver/temperature_sensor.h"
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
#define ESP32_HAS_BLE 1
#define BLE_ADVERT_NAME "RNGDS_ESP32C6"
#define ESP32_HAS_TEMP 1
#include "driver/temperature_sensor.h"
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
#define ESP32_HAS_BLE 0
#define ESP32_HAS_TEMP 1
#include "driver/temperature_sensor.h"
#else
#define ESP32_HAS_BLE 1
#define BLE_ADVERT_NAME "RNGDS"
#define ESP32_HAS_TEMP 0
#endif

#if ESP32_HAS_BLE
#include <NimBLEDevice.h>
#include <NimBLEServer.h>
#include <NimBLEUtils.h>
#endif

// Message pool for zero-malloc execution
#define MSG_POOL_SIZE 10
#define MAX_MSG_SIZE 256
struct ExecMessage {
  char payload[MAX_MSG_SIZE];
  uint16_t length;
  bool inUse;
};

// CPU load monitoring (declare early for use in callbacks)
volatile uint8_t coreLoadPct[2] = { 0, 0 };

// FreeRTOS runtime counter (microsecond resolution, 584k year wrap time)
static uint64_t runtimeOffsetUs = 0;

extern "C" void configureTimerForRunTimeStats(void) {
  runtimeOffsetUs = esp_timer_get_time();
}

extern "C" uint32_t ulGetRunTimeCounterValue(void) {
  return (uint32_t)(esp_timer_get_time() - runtimeOffsetUs);
}

// System configuration
#define WDT_TIMEOUT 20
#define MAX_BLE_CMD_LENGTH 256
#define STACK_CHECK_INTERVAL 60000
#define WIFI_RECONNECT_DELAY 15000
#define WIFI_CONNECT_TIMEOUT 30000

// Board-specific LED pins
#if defined(CONFIG_IDF_TARGET_ESP32C3)
#define BLE_LED_PIN 8
#define LED_INVERTED 1
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
#define BLE_LED_PIN 15
#define LED_INVERTED 0
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
#define BLE_LED_PIN 48
#define LED_INVERTED 0
#elif defined(CONFIG_IDF_TARGET_ESP32S2)
#define BLE_LED_PIN 18
#define LED_INVERTED 0
#else
#define BLE_LED_PIN 2
#define LED_INVERTED 0
#endif
#define BLE_LED_BLINK_MS 500

// Core count
#if CONFIG_FREERTOS_UNICORE
#define NUM_CORES 1
#else
#define NUM_CORES 2
#endif

// BLE UUIDs
static const char* BLE_SERVICE_UUID = "4fafc201-1fb5-459e-8fcc-c5c9c331914b";
static const char* BLE_CHAR_UUID_RX = "beb5483e-36e1-4688-b7f5-ea07361b26a8";
static const char* BLE_CHAR_UUID_TX = "beb5483e-36e1-4688-b7f5-ea07361b26a9";

#if ESP32_HAS_BLE
NimBLEServer* pBLEServer = nullptr;
NimBLECharacteristic* pTxCharacteristic = nullptr;
#endif

bool bleDeviceConnected = false;
bool bleOldDeviceConnected = false;

// Network configuration stored in NVS
struct {
  bool useDHCP;
  IPAddress staticIP;
  IPAddress gateway;
  IPAddress subnet;
  IPAddress dns;
} netConfig = {
  true,
  IPAddress(192, 168, 1, 100),
  IPAddress(192, 168, 1, 1),
  IPAddress(255, 255, 255, 0),
  IPAddress(8, 8, 8, 8)
};

WebServer server(80);
Preferences prefs;

// Per-task monitoring data
#define MAX_TASKS_MONITORED 64
struct TaskMonitorData {
  String name;
  UBaseType_t priority;
  eTaskState state;
  uint32_t runtime;
  uint32_t prevRuntime;
  uint64_t runtimeAccumUs;
  uint32_t stackHighWater;
  uint8_t cpuPercent;
  String stackHealth;
  BaseType_t coreAffinity;
  TaskHandle_t handle;
};

TaskMonitorData taskData[MAX_TASKS_MONITORED];
uint8_t taskCount = 0;
uint32_t lastTaskSample = 0;
bool statsInitialized = false;

// Per-core runtime tracking
struct CoreRuntimeData {
  uint64_t totalRuntime100ms;
  uint64_t prevTotalRuntime100ms;
  uint8_t taskCount;
  uint8_t cpuPercentTotal;
};

CoreRuntimeData coreRuntime[2];
uint64_t noAffinityRuntime100ms = 0;

uint64_t coreAccumUs[2] = { 0, 0 };
uint64_t noAffinityAccumUs = 0;
uint32_t lastStackCheck = 0;

// Business logic
enum BizState : uint8_t { BIZ_STOPPED = 0,
                          BIZ_RUNNING = 1 };
volatile BizState gBizState = BIZ_STOPPED;
QueueHandle_t execQ = nullptr;
volatile uint32_t bizProcessed = 0;
TaskHandle_t webTaskHandle = nullptr;
TaskHandle_t bizTaskHandle = nullptr;
TaskHandle_t sysTaskHandle = nullptr;

// WiFi state machine
enum WiFiState : uint8_t {
  WIFI_STATE_IDLE = 0,
  WIFI_STATE_CONNECTING,
  WIFI_STATE_CONNECTED,
  WIFI_STATE_DISCONNECTED
};

volatile WiFiState wifiState = WIFI_STATE_IDLE;
uint32_t wifiLastConnectAttempt = 0;
bool wifiManualDisconnect = false;
uint8_t wifiReconnectAttempts = 0;
const uint8_t MAX_WIFI_RECONNECT_ATTEMPTS = 10;

#if ESP32_HAS_TEMP
static temperature_sensor_handle_t s_temp_sensor = NULL;
#endif

ExecMessage msgPool[MSG_POOL_SIZE];
SemaphoreHandle_t poolMutex = nullptr;

// Memory information structure
struct MemoryInfo {
  uint32_t flashSizeMB;
  uint32_t psramSizeBytes;
  uint32_t psramFreeBytes;
  bool hasPsram;
};

#if ENABLE_OTA
// OTA Update state
enum OTAState : uint8_t {
  OTA_IDLE = 0,
  OTA_CHECKING,
  OTA_DOWNLOADING,
  OTA_FLASHING,  // <-- NEW STATE (value 3)
  OTA_SUCCESS,   // <-- is now 4
  OTA_FAILED     // <-- is now 5
};

struct OTAStatus {
  volatile OTAState state;
  volatile uint8_t progress;
  String error;
  bool available;
  volatile uint32_t fileSize;
};

OTAStatus otaStatus = { OTA_IDLE, 0, "", true, 0 };

SemaphoreHandle_t otaMutex = nullptr;
SemaphoreHandle_t taskDeletionMutex = nullptr;
volatile bool tasksDeleted = false;

// Task exit signals for graceful shutdown
volatile bool webTaskShouldExit = false;
volatile bool bizTaskShouldExit = false;

// OTA in progress flag to prevent WiFi management interference
volatile bool otaInProgress = false;
#endif

// Forward declarations
static void handleBLECommand(String cmd);
static void setupWiFi();
static void checkWiFiConnection();
static void updateTaskMonitoring();
static void sendTaskMonitoring();
static void routes();
static void systemTask(void* param);
static void webTask(void* param);
static void bizTask(void* param);
static void handleApiStatus();
static MemoryInfo getMemoryInfo();
static void sendIndex();

// ========== OTA Helper Functions ==========

#if ENABLE_OTA
static inline bool isOtaActive() {
  bool active = false;
  if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
    active = (otaStatus.state == OTA_CHECKING || otaStatus.state == OTA_DOWNLOADING);
    xSemaphoreGive(otaMutex);
  }
  return active;
}
#else
static inline bool isOtaActive() {
  return false;
}
#endif

// A tiny JSON reply to keep UI polling without stressing flash mappings
static inline void sendBusyJson(WebServer& s, const char* msg = "OTA in progress") {
  s.send(503, "application/json", String("{\"err\":\"") + msg + "\"}");
}

// A tiny HTML page for "/" during OTA (prevents big PROGMEM streaming)
// A tiny HTML page for "/" during OTA (prevents big PROGMEM streaming)
static const char OTA_BUSY_HTML[] PROGMEM = R"HTML(
<!doctype html><html><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>OTA Updating...</title>
<style>
body{font-family:system-ui,-apple-system,Segoe UI,Roboto,Ubuntu,'Helvetica Neue',Arial;
background:#0d1117;color:#c9d1d9;display:flex;align-items:center;justify-content:center;
min-height:100vh;margin:0}
.card{background:#161b22;border:1px solid #30363d;border-radius:10px;padding:18px;max-width:420px;width:90%}
.h{color:#58a6ff;margin:0 0 8px 0}
.p{margin:0 0 12px 0;color:#8b949e;font-size:0.9em}
.bar{height:10px;background:#21262d;border:1px solid #30363d;border-radius:6px;overflow:hidden}
.fill{height:100%;width:0%;background:linear-gradient(90deg,#238636,#3fb950);transition:width 0.4s ease;}
.small{color:#8b949e;font-size:12px;margin-top:8px;text-align:center;min-height:1em}
</style></head><body>
<div class="card">
 <h3 class="h" id="otaTitle">Updating firmware...</h3>
 <p class="p" id="otaStatusText">Device is applying an update. Please wait...</p>
 <div class="bar"><div class="fill" id="otaFill"></div></div>
 <p class="small" id="otaProgressText">Connecting...</p>
</div>
<script>
function fmB(b){if(!b||b<0)return'0B';if(b<1024)return`${b}B`;if(b<1048576)return`${(b/1024).toFixed(1)}KB`;return`${(b/1048576).toFixed(2)}MB`;}
const fill=document.getElementById('otaFill');
const prog=document.getElementById('otaProgressText');
const title=document.getElementById('otaTitle');
const status=document.getElementById('otaStatusText');
let isFlashing = false;

// --- NEW HYBRID POLL FUNCTION ---
// 1. Polls for progress during download.
// 2. Switches to reboot polling when flashing begins.

// Simple poller for reboot
function pollForReboot() {
  setTimeout(() => {
    fetch('/')
      .then(r => {
        if (r.ok) {
          prog.textContent = 'Reboot complete. Reloading...';
          location.reload();
        } else {
          prog.textContent = 'Server error. Retrying...';
          pollForReboot(); // Recurse
        }
      })
      .catch(e => {
        prog.textContent = 'Device rebooting... Reconnecting...';
        pollForReboot(); // Recurse
      });
  }, 2000); // Check every 2 seconds
}

// Main poller for download progress
async function pollProgress(){
  if (isFlashing) return; // Switched to reboot polling

  try{
   const r = await fetch('/api/ota/status');
   if (!r.ok) {
     prog.textContent = 'Reconnecting...';
     setTimeout(pollProgress, 1500);
     return;
   }

   const j = await r.json();
   if(!j) { setTimeout(pollProgress, 1500); return; }

