AlexLeeChan/esp32template/esp32template v1.ino
   // Exit states: Reload to main page
   // On reboot, server will send state 0 (OTA_IDLE), triggering this.
   if(j.state===0 || j.state===4 || j.state===5){ 
     prog.textContent = 'Update complete. Reloading...';
     location.reload(); 
     return; 
   }

   // State 1 (Checking) or 2 (Downloading): Update progress bar
   if(j.state===1 || j.state===2) {
     title.textContent = (j.state===1) ? 'Checking...' : 'Downloading...';
     status.textContent = (j.state===1) ? 'Checking for firmware update...' : 'Downloading new firmware. Do not unplug.';
     const p = j.progress || 0;
     fill.style.width = p + '%';
     
     let pText = p + '%';
     if (j.file_size > 0) {
       const downloaded = fmB((j.file_size * p) / 100);
       const total = fmB(j.file_size);
       pText = `${p}% (${downloaded} / ${total})`;
     }
     prog.textContent = pText;
   
   // State 3 (Flashing): Update UI and switch to reboot polling
   } else if (j.state===3) {
     isFlashing = true; // Stop this poll loop
     title.textContent = 'Flashing...';
     status.textContent = 'Download complete. Writing to flash...';
     prog.textContent = 'This may take a minute. Device will reboot.';
     fill.style.width = '100%';
     
     // Start the simple reboot poller
     pollForReboot();
     return; // Stop this function
   }
  }catch(e){
   prog.textContent = 'Connection lost. Retrying...';
  }
  
  // If not flashing, continue polling for progress
  if (!isFlashing) {
    setTimeout(pollProgress, 1000);
  }
 }
 
 // Start the main progress poller
 pollProgress();
</script>
</body></html>
)HTML";

// ========== Guarded Handlers ==========

void sendIndex_guarded() {
  if (isOtaActive()) {
    server.sendHeader(F("Cache-Control"), F("no-store, no-cache, must-revalidate, max-age=0"));
    server.sendHeader(F("Pragma"), F("no-cache"));
    server.setContentLength(sizeof(OTA_BUSY_HTML) - 1);
    server.send_P(200, PSTR("text/html"), OTA_BUSY_HTML);
    return;
  }
  sendIndex();
}

void sendTaskMonitoring_guarded() {
  if (isOtaActive()) {
    sendBusyJson(server);
    return;
  }
  sendTaskMonitoring();
}

void handleApiStatus_guarded() {
  if (isOtaActive()) {
    DynamicJsonDocument doc(256);
    doc["connected"] = (WiFi.status() == WL_CONNECTED);
    doc["ble"] = false;
    doc["uptime_ms"] = millis();
    doc["ota_active"] = true;
    String out;
    serializeJson(doc, out);
    server.send(200, "application/json", out);
    return;
  }
  handleApiStatus();
}

// ============================================================================
// OTA handling - OPTIMIZED VERSION WITH GRACEFUL TASK SHUTDOWN
// ============================================================================
#if ENABLE_OTA
static void dumpPartitionInfo(String& logOutput) {
  logOutput = "--- Partition Table ---\n";
  const esp_partition_t* running = esp_ota_get_running_partition();

  esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
  if (!it) {
    logOutput += "Failed to find partitions!\n";
    return;
  }

  char buf[256];
  while (it != NULL) {
    const esp_partition_t* p = esp_partition_get(it);
    if (!p) {
      it = esp_partition_next(it);
      continue;
    }

    snprintf(buf, sizeof(buf), "Label: %-16s | Type: 0x%02x | Sub: 0x%02x | Addr: 0x%08x | Size: %u (%.2fMB) %s\n",
             p->label, p->type, p->subtype,
             p->address, p->size, (float)p->size / 1024.0 / 1024.0,
             (p == running) ? "<- RUNNING" : "");
    logOutput += buf;

    it = esp_partition_next(it);
  }
  esp_partition_iterator_release(it);

  const esp_partition_t* next = esp_ota_get_next_update_partition(NULL);
  if (next) {
    snprintf(buf, sizeof(buf), "Next OTA Partition: %s\n", next->label);
    logOutput += buf;
  } else {
    logOutput += "Next OTA Partition: NOT FOUND!\n";
  }
}

static void handleOTAStatus() {
  DynamicJsonDocument doc(512);

  // --- FIX: Always check for a valid OTA partition ---
  const esp_partition_t* ota_partition = esp_ota_get_next_update_partition(NULL);
  otaStatus.available = (ota_partition != NULL);
  // --- END FIX ---

  if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
    doc["available"] = otaStatus.available; // This value is now always fresh
    doc["state"] = (uint8_t)otaStatus.state;
    doc["progress"] = otaStatus.progress;
    doc["error"] = otaStatus.error;
    doc["file_size"] = otaStatus.fileSize;

    // --- FIX FOR RACE CONDITION ---
    // Only call esp_ota functions when the OTA task is IDLE or FAILED.
    if (otaStatus.state == OTA_IDLE || otaStatus.state == OTA_FAILED) {
      const esp_partition_t* running = esp_ota_get_running_partition();
      if (running) {
        doc["current_partition"] = running->label;
      }
      
      // We already called this, but we'll use the variable again
      if (ota_partition) {
        doc["next_partition"] = ota_partition->label;
        doc["partition_size"] = ota_partition->size;
      }
    }
    // --- END FIX ---

    xSemaphoreGive(otaMutex);
  }

  doc["sketch_size"] = ESP.getSketchSize();
  doc["free_sketch_space"] = ESP.getFreeSketchSpace();
  doc["sketch_md5"] = ESP.getSketchMD5();

  String output;
  output.reserve(512);
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

static void handleOTAInfo() {
  String partitionInfo;
  dumpPartitionInfo(partitionInfo);
  server.send(200, F("text/plain"), partitionInfo);
}

// Signal tasks to exit gracefully and wait for them
static void deleteNonEssentialTasks() {
  if (xSemaphoreTake(taskDeletionMutex, pdMS_TO_TICKS(500)) == pdTRUE) {
    
    // --- MODIFIED: This function now ONLY stops bizTask ---
    if (bizTaskHandle != NULL) {
      Serial.println(F("\n=== Stopping bizTask for OTA ==="));
      gBizState = BIZ_STOPPED;
      vTaskDelay(pdMS_TO_TICKS(100));
      bizTaskShouldExit = true;

      uint8_t waitCount = 0;
      while (bizTaskHandle != NULL && waitCount < 20) { // 1 sec wait
        vTaskDelay(pdMS_TO_TICKS(50));
        waitCount++;
      }

      if (bizTaskHandle != NULL) {
        Serial.println(F("Warning: bizTask didn't exit gracefully, force deleting..."));
        vTaskDelete(bizTaskHandle);
        bizTaskHandle = NULL;
      } else {
        Serial.println(F("bizTask exited gracefully"));
      }
      Serial.println(F("=== bizTask Deletion Complete ===\n"));
    }
    
    tasksDeleted = true; // We use this flag to know bizTask needs recreating
    xSemaphoreGive(taskDeletionMutex);
  }
}

// --- NEW FUNCTION ---
// This is called AFTER download, just before flashing
static void deleteWebTask() {
  if (xSemaphoreTake(taskDeletionMutex, pdMS_TO_TICKS(500)) == pdTRUE) {
    if (webTaskHandle != NULL) {
      Serial.println(F("\n=== Stopping webTask for OTA Flash ==="));
      webTaskShouldExit = true;

      uint8_t waitCount = 0;
      while (webTaskHandle != NULL && waitCount < 20) { // 1 sec wait
        vTaskDelay(pdMS_TO_TICKS(50));
        waitCount++;
      }

      if (webTaskHandle != NULL) {
        Serial.println(F("Warning: webTask didn't exit gracefully, force deleting..."));
        vTaskDelete(webTaskHandle);
        webTaskHandle = NULL;
      } else {
        Serial.println(F("webTask exited gracefully"));
      }
      Serial.println(F("=== webTask Deletion Complete ===\n"));
    }
    xSemaphoreGive(taskDeletionMutex);
  }
}

// Recreate tasks after OTA failure
static void recreateTasks() {
  if (xSemaphoreTake(taskDeletionMutex, pdMS_TO_TICKS(500)) == pdTRUE) {
    
    // --- MODIFIED: No longer checks 'tasksDeleted' flag ---
    // Instead, it just recreates any task that is missing.
    
    Serial.println(F("\n=== Recreating Tasks After OTA Failure ==="));
    
    // Reset exit flags
    webTaskShouldExit = false;
    bizTaskShouldExit = false;
    
    // Recreate biz task
    if (bizTaskHandle == NULL) {
      Serial.println(F("Creating bizTask..."));
#if NUM_CORES > 1
      BaseType_t result = xTaskCreatePinnedToCore(bizTask, "biz", 4096, nullptr, 1, &bizTaskHandle, 1);
#else
      BaseType_t result = xTaskCreate(bizTask, "biz", 4096, nullptr, 1, &bizTaskHandle);
#endif
      if (result == pdPASS) {
        Serial.println(F("bizTask created"));
      } else {
        Serial.println(F("FAILED to create bizTask!"));
      }
    }
    
    // Recreate web task
    if (webTaskHandle == NULL) {
      Serial.println(F("Creating webTask..."));
#if NUM_CORES > 1
      BaseType_t result = xTaskCreatePinnedToCore(webTask, "web", 8192, nullptr, 1, &webTaskHandle, 0);
#else
      BaseType_t result = xTaskCreate(webTask, "web", 8192, nullptr, 1, &webTaskHandle);
#endif
      if (result == pdPASS) {
        Serial.println(F("webTask created"));
      } else {
        Serial.println(F("FAILED to create webTask!"));
      }
    }

    // Reset this flag (in case it was set by deleteNonEssentialTasks)
    tasksDeleted = false;
    xSemaphoreGive(taskDeletionMutex);
    
