AlexLeeChan/esp32template/esp32template v1.ino
    vTaskDelay(pdMS_TO_TICKS(500));
    Serial.println(F("=== Task Recreation Complete ===\n"));
  }
}

static void handleOTAUpdate() {
  if (!server.hasArg("plain")) {
    server.send(400, F("application/json"), F("{\"err\":\"no body\"}"));
    return;
  }

  StaticJsonDocument<512> doc;
  DeserializationError error = deserializeJson(doc, server.arg("plain"));
  if (error) {
    server.send(400, F("application/json"), F("{\"err\":\"bad json\"}"));
    return;
  }

  const char* url = doc["url"] | "";
  if (strlen(url) == 0) {
    server.send(400, F("application/json"), F("{\"err\":\"url required\"}"));
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    server.send(503, F("application/json"), F("{\"err\":\"WiFi not connected\"}"));
    return;
  }

  if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
    if (otaStatus.state != OTA_IDLE) {
      xSemaphoreGive(otaMutex);
      server.send(409, F("application/json"), F("{\"err\":\"update in progress\"}"));
      return;
    }
    otaStatus.state = OTA_CHECKING;
    otaStatus.progress = 0;
    otaStatus.error = "";
    otaStatus.fileSize = 0;
    xSemaphoreGive(otaMutex);
  }

  server.send(200, F("application/json"), F("{\"msg\":\"update started\"}"));
  server.client().flush();
  delay(100);

  String* otaUrlPtr = new String(url);
  
  uint32_t freeHeap = ESP.getFreeHeap();
  Serial.printf("Pre-OTA Free Heap: %u bytes\n", freeHeap);
  
  if (freeHeap < 50000) {
    Serial.println(F("ERROR: Insufficient memory for OTA!"));
    if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
      otaStatus.state = OTA_FAILED;
      otaStatus.error = F("Insufficient memory");
      xSemaphoreGive(otaMutex);
    }
    delete otaUrlPtr;
    return;
  }

  BaseType_t taskCreated = xTaskCreate(
    [](void* param) {
      esp_task_wdt_add(NULL);
      esp_task_wdt_reset();
      
      String* urlPtr = (String*)param;
      String url = *urlPtr;
      delete urlPtr;
      
      Serial.println(F("\n╔════════════════════════════════════════╗"));
      Serial.println(F("║     OTA UPDATE STARTED             ║"));
      Serial.println(F("╚════════════════════════════════════════╝"));
      Serial.printf("URL: %s\n", url.c_str());
      Serial.printf("Free Heap: %u bytes\n\n", ESP.getFreeHeap());
      
      vTaskDelay(pdMS_TO_TICKS(300));
      esp_task_wdt_reset();
      
      // --- webTask is ALIVE, so keep routes active ---
      server.on("/api/ota/status", HTTP_GET, handleOTAStatus);
      server.on("/api/ota/reset", HTTP_POST, handleOTAReset);
      server.on("/api/ota/update", HTTP_POST, handleOTAUpdate);

      // --- Only kills bizTask ---
      deleteNonEssentialTasks(); 
      esp_task_wdt_reset();

      #if ESP32_HAS_BLE
        Serial.println(F("Stopping BLE to free heap..."));
        NimBLEDevice::deinit();
        vTaskDelay(pdMS_TO_TICKS(100));
        Serial.printf("Heap after BLE deinit: %u bytes\n", ESP.getFreeHeap());
      #endif
      
      otaInProgress = true;
      Serial.println(F("OTA in progress flag set - WiFi management disabled"));
      
      if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        otaStatus.state = OTA_DOWNLOADING;
        otaStatus.progress = 1;
        xSemaphoreGive(otaMutex);
      }
      
      esp_wifi_set_ps(WIFI_PS_NONE);
      Serial.println(F("WiFi power save disabled"));
      
      vTaskDelay(pdMS_TO_TICKS(200));
      esp_task_wdt_reset();
      
      HTTPClient httpClient;
      WiFiClientSecure clientSecure;
      WiFiClient client;
      
      bool isSecure = url.startsWith("https://");
      
      clientSecure.setInsecure();
      clientSecure.setTimeout(30);
      client.setTimeout(30);
      
      if (isSecure) {
        httpClient.begin(clientSecure, url);
        Serial.println(F("Using HTTPS connection"));
      } else {
        httpClient.begin(client, url);
        Serial.println(F("Using HTTP connection"));
      }
      
      httpClient.setUserAgent(F("ESP32-OTA/1.0"));
      httpClient.setTimeout(15000); // 15s timeout < 20s WDT
      httpClient.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
      httpClient.setReuse(false);
      
      esp_task_wdt_reset();
      
      Serial.println(F("Sending HTTP GET request..."));
      int httpCode = httpClient.GET();
      
      // Handle redirects manually
      if (httpCode == HTTP_CODE_MOVED_PERMANENTLY || httpCode == HTTP_CODE_FOUND || 
          httpCode == HTTP_CODE_SEE_OTHER || httpCode == HTTP_CODE_TEMPORARY_REDIRECT) {
        
        String newLocation = httpClient.getLocation();
        Serial.printf("Redirect %d to: %s\n", httpCode, newLocation.c_str());
        
        httpClient.end();
        
        if (isSecure) {
          clientSecure.stop();
          Serial.println(F("Stopped secure client"));
        } else {
          client.stop();
          Serial.println(F("Stopped regular client"));
        }
        
        vTaskDelay(pdMS_TO_TICKS(300));
        esp_task_wdt_reset();
        
        bool newIsSecure = newLocation.startsWith("https://");
        
        if (newIsSecure) {
          Serial.println(F("Following redirect with HTTPS..."));
          clientSecure.setInsecure();
          clientSecure.setTimeout(30);
          httpClient.begin(clientSecure, newLocation);
        } else {
          Serial.println(F("Following redirect with HTTP..."));
          client.setTimeout(30);
          httpClient.begin(client, newLocation);
        }
        
        isSecure = newIsSecure;
        httpClient.setUserAgent(F("ESP32-OTA/1.0"));
        httpClient.setTimeout(15000); // 15s timeout < 20s WDT
        httpClient.setReuse(false);
        
        vTaskDelay(pdMS_TO_TICKS(100));
        esp_task_wdt_reset();
        
        Serial.println(F("Sending redirected GET request..."));
        httpCode = httpClient.GET();
        
        Serial.printf("After redirect, HTTP code: %d\n", httpCode);
      }
      
      if (httpCode != HTTP_CODE_OK) {
        char errStr[160];
        String location = httpClient.getLocation();
        if (location.length() > 0 && httpCode >= 300 && httpCode < 400) {
          snprintf(errStr, sizeof(errStr), "HTTP %d -> %s", httpCode, location.c_str());
        } else {
          snprintf(errStr, sizeof(errStr), "HTTP %d: %s", 
                   httpCode, httpClient.errorToString(httpCode).c_str());
        }
        Serial.printf("ERROR: %s\n", errStr);
        
        if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
          otaStatus.state = OTA_FAILED;
          otaStatus.error = errStr;
          xSemaphoreGive(otaMutex);
        }
        
        otaInProgress = false;
        httpClient.end();
        esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
        esp_task_wdt_delete(NULL);
        recreateTasks(); // This will recreate bizTask
        vTaskDelete(NULL);
        return;
      }
      
      int contentLength = httpClient.getSize();
      if (contentLength <= 0) {
        Serial.println(F("ERROR: Invalid Content-Length"));
        
        if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
          otaStatus.state = OTA_FAILED;
          otaStatus.error = F("Invalid content length");
          xSemaphoreGive(otaMutex);
        }
        
        otaInProgress = false;
        httpClient.end();
        esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
        esp_task_wdt_delete(NULL);
        recreateTasks(); // This will recreate bizTask
        vTaskDelete(NULL);
        return;
      }
      
