AlexLeeChan/esp32template/esp32template v1.ino
      Serial.printf("HTTP OK - Content-Length: %d bytes (%.2f MB)\n", 
                   contentLength, contentLength / 1048576.0);
      
      if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        otaStatus.fileSize = contentLength;
        xSemaphoreGive(otaMutex);
      }
      
      esp_task_wdt_reset();
      
      const esp_partition_t* update_partition = esp_ota_get_next_update_partition(NULL);
      if (!update_partition) {
        Serial.println(F("ERROR: No OTA partition available!"));
        
        if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
          otaStatus.state = OTA_FAILED;
          otaStatus.error = F("No OTA partition");
          xSemaphoreGive(otaMutex);
        }
        
        otaInProgress = false;
        httpClient.end();
        esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
        esp_task_wdt_delete(NULL);
        recreateTasks(); // This will recreate bizTask
        vTaskDelete(NULL);
        return;
      }
      
      if (contentLength > update_partition->size) {
        char errStr[128];
        snprintf(errStr, sizeof(errStr), 
                 "File too large! %d > %u bytes", 
                 contentLength, update_partition->size);
        Serial.println(errStr);
        
        if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
          otaStatus.state = OTA_FAILED;
          otaStatus.error = errStr;
          xSemaphoreGive(otaMutex);
        }
        
        otaInProgress = false;
        httpClient.end();
        esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
        esp_task_wdt_delete(NULL);
        recreateTasks(); // This will recreate bizTask
        vTaskDelete(NULL);
        return;
      }
      
      Serial.printf("Target partition: %s (%.2f MB)\n", 
                   update_partition->label, update_partition->size / 1048576.0);
      
      Update.abort();
      vTaskDelay(pdMS_TO_TICKS(100));
      esp_task_wdt_reset();
      
      Serial.println(F("\nStarting Update.begin()..."));
      if (!Update.begin(contentLength, U_FLASH)) {
        char errStr[128];
        snprintf(errStr, sizeof(errStr), "Update.begin() error: %u", Update.getError());
        Serial.printf("ERROR: %s\n", errStr);
        Serial.println(Update.errorString());
        
        if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
          otaStatus.state = OTA_FAILED;
          otaStatus.error = errStr;
          xSemaphoreGive(otaMutex);
        }
        
        otaInProgress = false;
        httpClient.end();
        esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
        esp_task_wdt_delete(NULL);
        recreateTasks(); // This will recreate bizTask
        vTaskDelete(NULL);
        return;
      }
      
      Serial.println(F("Update.begin() successful!"));
      esp_task_wdt_reset(); 
      Serial.println(F("\n--- Starting Download & Flash ---"));
      
      esp_task_wdt_reset();
      
      WiFiClient* stream = isSecure ? (WiFiClient*)&clientSecure : &client;
      
      size_t written = 0;
      unsigned long lastProgress = 0;
      unsigned long lastWdtReset = 0;
      uint8_t lastPrintedPercent = 0;
      uint8_t buff[1024];
      
      while (written < contentLength) {
        if (millis() - lastWdtReset > 5000) {
          esp_task_wdt_reset();
          lastWdtReset = millis();
        }
        
        if (WiFi.status() != WL_CONNECTED) {
          Serial.println(F("\nERROR: WiFi disconnected!"));
          
          if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
            otaStatus.state = OTA_FAILED;
            otaStatus.error = F("WiFi disconnected");
            xSemaphoreGive(otaMutex);
          }
          
          Update.abort();
          otaInProgress = false;
          httpClient.end();
          esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
          esp_task_wdt_delete(NULL);
          recreateTasks(); // This will recreate bizTask
          vTaskDelete(NULL);
          return;
        }
        
        size_t available = stream->available();
        if (available) {
          int len = stream->readBytes(buff, min(sizeof(buff), available));
          
          if (len > 0) {
            if (Update.write(buff, len) != len) {
              char errStr[128];
              snprintf(errStr, sizeof(errStr), 
                       "Write failed at %u/%d! Error: %u", 
                       written, contentLength, Update.getError());
              Serial.printf("\nERROR: %s\n", errStr);
              
              if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
                otaStatus.state = OTA_FAILED;
                otaStatus.error = errStr;
                xSemaphoreGive(otaMutex);
              }
              
              Update.abort();
              otaInProgress = false;
              httpClient.end();
              esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
              esp_task_wdt_delete(NULL);
              recreateTasks(); // This will recreate bizTask
              vTaskDelete(NULL);
              return;
            }
            
            written += len;
            
            if (millis() - lastProgress > 500 || written >= contentLength) {
              lastProgress = millis();
              uint8_t progress = (written * 100) / contentLength;
              
              if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(5)) == pdTRUE) {
                otaStatus.progress = progress;
                xSemaphoreGive(otaMutex);
              }
              
              if (progress / 10 > lastPrintedPercent / 10) {
                Serial.printf("Progress: %u%% (%u/%d bytes)\n", 
                             progress, written, contentLength);
                lastPrintedPercent = progress;
              }
            }
          }
        }
        
        vTaskDelay(1);
      }
      
      httpClient.end();
      
      Serial.printf("\nDownload complete! %u bytes written\n", written);
      
      // --- NEW LOGIC: Set Flashing state, kill webTask, then flash ---
      
      Serial.println(F("Setting state to FLASHING"));
      if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        otaStatus.state = OTA_FLASHING; // Set new state
        otaStatus.progress = 100;
        xSemaphoreGive(otaMutex);
      }
      
