AlexLeeChan/esp32template/esp32template v1.ino
      // Give the web UI 2 seconds to poll one last time and see the "Flashing" message
      Serial.println(F("Waiting 2s for UI to update..."));
      vTaskDelay(pdMS_TO_TICKS(2000));
      
      // Now, kill the webTask to prevent race condition
      deleteWebTask();
      vTaskDelay(pdMS_TO_TICKS(200)); // Short delay for cleanup
      esp_task_wdt_reset();
      
      Serial.println(F("Finalizing update..."));
      
      if (!Update.end(true)) {
        char errStr[128];
        snprintf(errStr, sizeof(errStr), "Update.end() error: %u", Update.getError());
        Serial.printf("ERROR: %s\n", errStr);
        
        if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
          otaStatus.state = OTA_FAILED;
          otaStatus.error = errStr;
          xSemaphoreGive(otaMutex);
        }
        
        otaInProgress = false;
        esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
        esp_task_wdt_delete(NULL);
        recreateTasks(); // This will recreate BOTH tasks
        vTaskDelete(NULL);
        return;
      }
      
      if (!Update.isFinished()) {
        Serial.println(F("ERROR: Update not finished!"));
        
        if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
          otaStatus.state = OTA_FAILED;
          otaStatus.error = F("Update incomplete");
          xSemaphoreGive(otaMutex);
        }
        
        otaInProgress = false;
        esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
        esp_task_wdt_delete(NULL);
        recreateTasks(); // This will recreate BOTH tasks
        vTaskDelete(NULL);
        return;
      }
      
      Serial.println(F("\n╔════════════════════════════════════════╗"));
      Serial.println(F("║     OTA UPDATE SUCCESS!            ║"));
      Serial.println(F("╚════════════════════════════════════════╝"));
      Serial.println(F("Rebooting in 2 seconds...\n"));
      
      if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        otaStatus.state = OTA_SUCCESS;
        otaStatus.progress = 100;
        xSemaphoreGive(otaMutex);
      }
      
      otaInProgress = false;
      esp_task_wdt_delete(NULL);
      vTaskDelay(pdMS_TO_TICKS(2000));
      ESP.restart();
    },
    "ota_task",
    24576,
    otaUrlPtr,
    3,
    NULL
  );
  
  if (taskCreated != pdPASS) {
    Serial.println(F("CRITICAL: Failed to create OTA task!"));
    
    if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
      otaStatus.state = OTA_FAILED;
      otaStatus.error = F("Task creation failed");
      xSemaphoreGive(otaMutex);
    }
    
    delete otaUrlPtr;
  }
}

static void handleOTAReset() {
  if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
    otaStatus.state = OTA_IDLE;
    otaStatus.progress = 0;
    otaStatus.error = "";
    xSemaphoreGive(otaMutex);
  }
  
  recreateTasks();
  
  server.send(200, "application/json", "{\"msg\":\"OTA status reset and tasks restarted\"}");
}
#endif

// ============================================================================
// Message Pool
// ============================================================================

void initMessagePool() {
  poolMutex = xSemaphoreCreateMutex();
  for (int i = 0; i < MSG_POOL_SIZE; i++) {
    msgPool[i].inUse = false;
    msgPool[i].length = 0;
  }

#if ENABLE_OTA
  otaMutex = xSemaphoreCreateMutex();
  taskDeletionMutex = xSemaphoreCreateMutex();
  tasksDeleted = false;
  webTaskShouldExit = false;
  bizTaskShouldExit = false;
  otaInProgress = false;
  
  const esp_partition_t* ota_partition = esp_ota_get_next_update_partition(NULL);
  if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
    otaStatus.available = (ota_partition != NULL);
    xSemaphoreGive(otaMutex);
  }
#endif
}

ExecMessage* allocMessage() {
  if (xSemaphoreTake(poolMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
    for (int i = 0; i < MSG_POOL_SIZE; i++) {
      if (!msgPool[i].inUse) {
        msgPool[i].inUse = true;
        xSemaphoreGive(poolMutex);
        return &msgPool[i];
      }
    }
    xSemaphoreGive(poolMutex);
  }
  return nullptr;
}

void freeMessage(ExecMessage* msg) {
  if (msg && xSemaphoreTake(poolMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
    msg->inUse = false;
    msg->length = 0;
    xSemaphoreGive(poolMutex);
  }
}

void updateCpuLoad() {
  for (uint8_t i = 0; i < taskCount; i++) {
    if (taskData[i].name.equals("IDLE0") || (NUM_CORES == 1 && taskData[i].name.equals("IDLE"))) {
      coreLoadPct[0] = (taskData[i].cpuPercent > 100) ? 0 : (100 - taskData[i].cpuPercent);
    }

#if NUM_CORES > 1
    else if (taskData[i].name.equals("IDLE1")) {
      coreLoadPct[1] = (taskData[i].cpuPercent > 100) ? 0 : (100 - taskData[i].cpuPercent);
    }
#endif
  }
}

// ============================================================================
// Health Monitoring
// ============================================================================

void checkTaskStacks() {
  uint32_t now = millis();
  if (now - lastStackCheck < STACK_CHECK_INTERVAL) return;
  lastStackCheck = now;

  if (webTaskHandle) uxTaskGetStackHighWaterMark(webTaskHandle);
  if (bizTaskHandle) uxTaskGetStackHighWaterMark(bizTaskHandle);
  if (sysTaskHandle) uxTaskGetStackHighWaterMark(sysTaskHandle);
}

// ============================================================================
// String Helpers
// ============================================================================

String cleanString(const String& input) {
  if (input.length() == 0) return String();
  const char* str = input.c_str();
  int len = input.length();
  int start = 0, end = len - 1;

  while (start < len && isspace((unsigned char)str[start])) start++;
  while (end >= start && isspace((unsigned char)str[end])) end--;

  return (start > end) ? String() : input.substring(start, end + 1);
}

bool isValidIP(const String& s) {
  IPAddress ip;
  if (!ip.fromString(s)) return false;
  return !(ip[0] == 0 && ip[1] == 0 && ip[2] == 0 && ip[3] == 0);
}

bool isValidSubnet(const String& s) {
  IPAddress sub;
  if (!sub.fromString(s)) return false;
  uint32_t m = ~(uint32_t)sub;
  return (m & (m + 1)) == 0;
}

IPAddress parseIP(const String& s) {
  IPAddress ip;
  if (ip.fromString(s)) return ip;

  int p[4] = { 0 };
  int idx = 0, st = 0;
  for (int i = 0; i <= s.length() && idx < 4; i++) {
    if (i == s.length() || s[i] == '.') {
      p[idx++] = s.substring(st, i).toInt();
      st = i + 1;
    }
  }
  return IPAddress(p[0], p[1], p[2], p[3]);
}

// ============================================================================
// NVS Storage
// ============================================================================

