AlexLeeChan/esp32template/esp32template v1.ino
void saveWiFi(const String& s, const String& p) {
  prefs.putString("wifi_ssid", s);
  prefs.putString("wifi_pass", p);
}

void saveNetworkConfig() {
  prefs.putBool("use_dhcp", netConfig.useDHCP);
  prefs.putUInt("static_ip", (uint32_t)netConfig.staticIP);
  prefs.putUInt("gateway", (uint32_t)netConfig.gateway);
  prefs.putUInt("subnet", (uint32_t)netConfig.subnet);
  prefs.putUInt("dns", (uint32_t)netConfig.dns);
}

void loadNetworkConfig() {
  netConfig.useDHCP = prefs.getBool("use_dhcp", true);
  netConfig.staticIP = prefs.getUInt("static_ip", (uint32_t)IPAddress(192, 168, 1, 100));
  netConfig.gateway = prefs.getUInt("gateway", (uint32_t)IPAddress(192, 168, 1, 1));
  netConfig.subnet = prefs.getUInt("subnet", (uint32_t)IPAddress(255, 255, 255, 0));
  netConfig.dns = prefs.getUInt("dns", (uint32_t)IPAddress(8, 8, 8, 8));
}

// ============================================================================
// Temperature Sensor
// ============================================================================

float getInternalTemperatureC() {
#if ESP32_HAS_TEMP
  if (s_temp_sensor == NULL) return NAN;
  float tsens_out;
  if (temperature_sensor_get_celsius(s_temp_sensor, &tsens_out) == ESP_OK) {
    return tsens_out;
  }
#endif
  return NAN;
}

// ============================================================================
// Memory Information
// ============================================================================
MemoryInfo getMemoryInfo() {
  MemoryInfo info;
  info.flashSizeMB = ESP.getFlashChipSize() / (1024 * 1024);

#if CONFIG_SPIRAM_SUPPORT || CONFIG_ESP32_SPIRAM_SUPPORT
  info.hasPsram = psramFound();
  if (info.hasPsram) {
    info.psramSizeBytes = ESP.getPsramSize();
    info.psramFreeBytes = ESP.getFreePsram();
  } else {
    info.psramSizeBytes = 0;
    info.psramFreeBytes = 0;
  }
#else
  info.hasPsram = false;
  info.psramSizeBytes = 0;
  info.psramFreeBytes = 0;
#endif

  return info;
}

// ============================================================================
// BLE Functions
// ============================================================================

void sendBLE(const String& m) {
#if ESP32_HAS_BLE
  if (!bleDeviceConnected || !pTxCharacteristic) return;

  const char* data = m.c_str();
  size_t len = m.length();

  if (len <= 512) {
    pTxCharacteristic->setValue((uint8_t*)data, len);
    pTxCharacteristic->notify();
  } else {
    for (size_t i = 0; i < len; i += 512) {
      size_t chunk_size = (len - i > 512) ? 512 : (len - i);
      pTxCharacteristic->setValue((uint8_t*)(data + i), chunk_size);
      pTxCharacteristic->notify();
      delay(20);
    }
  }
#else
  (void)m;
#endif
}

#if ESP32_HAS_BLE

class MyServerCallbacks : public NimBLEServerCallbacks {
  void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override {
    bleDeviceConnected = true;
    NimBLEDevice::getAdvertising()->stop();
    pServer->updateConnParams(connInfo.getConnHandle(), 30, 60, 0, 400);
  }

  void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override {
    bleDeviceConnected = false;
  }
};

class BLECommandBuffer {
 private:
  char buffer[MAX_BLE_CMD_LENGTH];
  size_t pos;

 public:
  BLECommandBuffer()
    : pos(0) {
    buffer[0] = '\0';
  }

  void append(const uint8_t* data, size_t len) {
    size_t available = MAX_BLE_CMD_LENGTH - pos - 1;
    size_t to_copy = min(len, available);
    if (to_copy > 0) {
      memcpy(buffer + pos, data, to_copy);
      pos += to_copy;
      buffer[pos] = '\0';
    }
  }

  bool hasComplete() const {
    return strchr(buffer, '\n') != nullptr;
  }

  String extractCommand() {
    char* newline = strchr(buffer, '\n');
    if (!newline) return String();

    *newline = '\0';
    String cmd(buffer);
    size_t remaining = pos - (newline - buffer + 1);
    if (remaining > 0) {
      memmove(buffer, newline + 1, remaining);
    }
    pos = remaining;
    buffer[pos] = '\0';
    return cmd;
  }
};

static BLECommandBuffer cmdBuffer;

class MyCharCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic* pChar, NimBLEConnInfo& connInfo) override {
    std::string value = pChar->getValue();
    if (value.length() > 0) {
      cmdBuffer.append((uint8_t*)value.data(), value.length());
      while (cmdBuffer.hasComplete()) {
        String cmd = cmdBuffer.extractCommand();
        cmd = cleanString(cmd);
        if (cmd.length() > 0) {
          handleBLECommand(cmd);
        }
      }
    }
  }
};

void initBLE() {
  NimBLEDevice::init(BLE_ADVERT_NAME);
  NimBLEDevice::setMTU(256);

  pBLEServer = NimBLEDevice::createServer();
  pBLEServer->setCallbacks(new MyServerCallbacks());

  NimBLEService* pService = pBLEServer->createService(BLE_SERVICE_UUID);
  pTxCharacteristic = pService->createCharacteristic(BLE_CHAR_UUID_TX, NIMBLE_PROPERTY::NOTIFY);

  NimBLECharacteristic* pRxCharacteristic = pService->createCharacteristic(
    BLE_CHAR_UUID_RX, NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR);
  pRxCharacteristic->setCallbacks(new MyCharCallbacks());

  pService->start();

  NimBLEAdvertising* pAdvertising = NimBLEDevice::getAdvertising();
  pAdvertising->addServiceUUID(BLE_SERVICE_UUID);
  NimBLEAdvertisementData advData;
  advData.setName(BLE_ADVERT_NAME);
  advData.addServiceUUID(BLE_SERVICE_UUID);
  pAdvertising->setAdvertisementData(advData);

  NimBLEAdvertisementData scanData;
  scanData.setName(BLE_ADVERT_NAME);
  pAdvertising->setScanResponseData(scanData);

  NimBLEDevice::setPower(ESP_PWR_LVL_P9);
  pAdvertising->start();
}

void handleBLEReconnect() {
  if (!bleDeviceConnected && bleOldDeviceConnected) {
    delay(500);
    NimBLEDevice::startAdvertising();
    bleOldDeviceConnected = bleDeviceConnected;
  }
  if (bleDeviceConnected && !bleOldDeviceConnected) {
    bleOldDeviceConnected = bleDeviceConnected;
  }
}

#else
void initBLE() {}
void handleBLEReconnect() {}
#endif

void handleBLECommand(String cmd) {
  cmd = cleanString(cmd);
  cmd.trim();
  String upper = cmd;
  upper.toUpperCase();
  String response;
  response.reserve(128);

