AlexLeeChan/esp32template/esp32template v1.ino
  if (upper.startsWith("SET_WIFI|") || upper.startsWith("WIFI:")) {
    String ssid, pass;
    if (upper.startsWith("SET_WIFI|")) {
      String rest = cmd.substring(9);
      int sep = rest.indexOf('|');
      if (sep > 0) {
        ssid = rest.substring(0, sep);
        pass = rest.substring(sep + 1);
      } else {
        sendBLE("ERR:FORMAT\n");
        return;
      }
    } else {
      String rest = cmd.substring(5);
      int sep = rest.indexOf(',');
      if (sep > 0) {
        ssid = rest.substring(0, sep);
        pass = rest.substring(sep + 1);
      } else {
        sendBLE("ERR:FORMAT\n");
        return;
      }
    }

    saveWiFi(ssid, pass);
    wifiManualDisconnect = false;
    wifiReconnectAttempts = 0;
    wifiState = WIFI_STATE_IDLE;
    sendBLE("OK:WIFI_SAVED\n");

    WiFi.disconnect(true, true);
    delay(500);
    WiFi.mode(WIFI_OFF);
    delay(500);
    WiFi.mode(WIFI_STA);
    delay(100);

    if (!netConfig.useDHCP) {
      WiFi.config(netConfig.staticIP, netConfig.gateway, netConfig.subnet, netConfig.dns);
    }
    WiFi.begin(ssid.c_str(), pass.c_str());
    wifiState = WIFI_STATE_CONNECTING;
    wifiLastConnectAttempt = millis();

  } else if (upper.startsWith("SET_IP|")) {
    String rest = cmd.substring(7);
    if (rest.equalsIgnoreCase("DHCP")) {
      netConfig.useDHCP = true;
      saveNetworkConfig();
      sendBLE("OK:DHCP_ON\n");

      String ssid = prefs.getString("wifi_ssid", "");
      String pass = prefs.getString("wifi_pass", "");
      if (ssid.length() > 0) {
        WiFi.disconnect(true, true);
        delay(500);
        WiFi.mode(WIFI_OFF);
        delay(500);
        WiFi.mode(WIFI_STA);
        delay(100);
        WiFi.begin(ssid.c_str(), pass.c_str());
        wifiState = WIFI_STATE_CONNECTING;
        wifiLastConnectAttempt = millis();
        wifiManualDisconnect = false;
        wifiReconnectAttempts = 0;
      }

    } else if (rest.startsWith("STATIC|") || rest.startsWith("static|")) {
      rest = rest.substring(7);
      int p1 = rest.indexOf('|');
      int p2 = rest.indexOf('|', p1 + 1);
      int p3 = rest.indexOf('|', p2 + 1);

      if (p1 > 0 && p2 > 0 && p3 > 0) {
        String ip = rest.substring(0, p1);
        String gw = rest.substring(p1 + 1, p2);
        String sub = rest.substring(p2 + 1, p3);
        String dns = rest.substring(p3 + 1);

        if (isValidIP(ip) && isValidIP(gw)) {
          netConfig.staticIP = parseIP(ip);
          netConfig.gateway = parseIP(gw);
          netConfig.subnet = isValidSubnet(sub) ? parseIP(sub) : IPAddress(255, 255, 255, 0);
          netConfig.dns = isValidIP(dns) ? parseIP(dns) : IPAddress(8, 8, 8, 8);
          netConfig.useDHCP = false;
          saveNetworkConfig();
          sendBLE("OK:STATIC_IP_SET\n");

          String ssid = prefs.getString("wifi_ssid", "");
          String pass = prefs.getString("wifi_pass", "");
          if (ssid.length() > 0) {
            WiFi.disconnect(true, true);
            delay(500);
            WiFi.mode(WIFI_OFF);
            delay(500);
            WiFi.mode(WIFI_STA);
            delay(100);

            WiFi.config(netConfig.staticIP, netConfig.gateway, netConfig.subnet, netConfig.dns);

            WiFi.begin(ssid.c_str(), pass.c_str());
            wifiState = WIFI_STATE_CONNECTING;
            wifiLastConnectAttempt = millis();
            wifiManualDisconnect = false;
            wifiReconnectAttempts = 0;
          }

        } else {
          sendBLE("ERR:INVALID_IP\n");
        }
      } else {
        sendBLE("ERR:FORMAT\n");
      }
    } else {
      sendBLE("ERR:FORMAT\n");
    }

  } else if (upper == "GET_STATUS" || upper == "STATUS") {
    bool connected = (WiFi.status() == WL_CONNECTED);
    response = "STATUS|";
    response += connected ? "CONNECTED" : "DISCONNECTED";
    response += "|" + WiFi.SSID() + "|";
    response += connected ? WiFi.localIP().toString() : "-";
    response += "|";
    response += connected ? String(WiFi.RSSI()) : "-";
    response += "|";
    response += netConfig.useDHCP ? "DHCP" : "STATIC";
    if (!netConfig.useDHCP) {
      response += "|" + netConfig.staticIP.toString();
    }
    response += "\n";
    sendBLE(response);

  } else if (upper == "DISCONNECT_WIFI" || upper == "DISCONNECT") {
    WiFi.disconnect(true, true);
    delay(200);
    wifiManualDisconnect = true;
    wifiState = WIFI_STATE_DISCONNECTED;
    sendBLE("OK:WIFI_DISCONNECTED\n");

  } else if (upper == "CLEAR_SAVED" || upper == "CLEAR_WIFI") {
    prefs.remove("wifi_ssid");
    prefs.remove("wifi_pass");
    WiFi.disconnect(true, true);
    delay(200);
    wifiManualDisconnect = true;
    wifiState = WIFI_STATE_IDLE;
    sendBLE("OK:WIFI_CLEARED\n");

  } else if (upper == "RESTART") {
    sendBLE("OK:RESTARTING\n");
    delay(150);
    ESP.restart();

  } else if (upper == "HEAP") {
    response = "HEAP:FREE=" + String(ESP.getFreeHeap());
    response += "|MIN=" + String(ESP.getMinFreeHeap());
    response += "|MAX=" + String(ESP.getMaxAllocHeap()) + "\n";
    sendBLE(response);

  } else if (upper == "TEMP") {
    float t = getInternalTemperatureC();
    if (isnan(t)) {
      sendBLE("TEMP:NOT_AVAILABLE\n");
    } else {
      sendBLE("TEMP:" + String(t, 2) + "\n");
    }

  } else {
    sendBLE("ERR:UNKNOWN_CMD\n");
  }
}

// ============================================================================
// WiFi Management
// ============================================================================

void setupWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(false);
  WiFi.setSleep(false);
  esp_wifi_set_storage(WIFI_STORAGE_RAM);

  String ssid = prefs.getString("wifi_ssid", "");
  String pass = prefs.getString("wifi_pass", "");
  if (ssid.length() == 0) return;

  WiFi.onEvent([](WiFiEvent_t event, WiFiEventInfo_t info) {
    switch (event) {
      case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      case ARDUINO_EVENT_WIFI_STA_GOT_IP:
        wifiState = WIFI_STATE_CONNECTED;
        break;
      case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
        if (!wifiManualDisconnect) {
          wifiState = WIFI_STATE_DISCONNECTED;
        }
        break;
      default:
        break;
    }
  });

  if (!netConfig.useDHCP) {
    WiFi.config(netConfig.staticIP, netConfig.gateway, netConfig.subnet, netConfig.dns);
  }

  WiFi.begin(ssid.c_str(), pass.c_str());
  wifiState = WIFI_STATE_CONNECTING;
  wifiLastConnectAttempt = millis();
  wifiReconnectAttempts = 1;
}

void checkWiFiConnection() {
  #if ENABLE_OTA
  // Don't manage WiFi during OTA - let OTA task handle it
  if (otaInProgress) return;
  #endif
  
  if (wifiManualDisconnect) return;

