AlexLeeChan/esp32template/esp32template v1.ino
  uint32_t now = millis();
  wl_status_t status = WiFi.status();

  switch (wifiState) {
    case WIFI_STATE_IDLE:
      if (prefs.getString("wifi_ssid", "").length() > 0) {
        if (wifiReconnectAttempts >= MAX_WIFI_RECONNECT_ATTEMPTS) {
          wifiManualDisconnect = true;
          return;
        }
        wifiState = WIFI_STATE_CONNECTING;
        wifiLastConnectAttempt = now;
        String ssid = prefs.getString("wifi_ssid", "");
        String pass = prefs.getString("wifi_pass", "");
        WiFi.begin(ssid.c_str(), pass.c_str());
        wifiReconnectAttempts++;
      }
      break;

    case WIFI_STATE_CONNECTING:
      if (status == WL_CONNECTED) {
        wifiState = WIFI_STATE_CONNECTED;
        wifiReconnectAttempts = 0;
        wifiLastConnectAttempt = now;
      } else if (now - wifiLastConnectAttempt > WIFI_CONNECT_TIMEOUT) {
        wifiState = WIFI_STATE_DISCONNECTED;
        wifiLastConnectAttempt = now;
      }
      break;

    case WIFI_STATE_CONNECTED:
      if (status != WL_CONNECTED) {
        wifiState = WIFI_STATE_DISCONNECTED;
        wifiLastConnectAttempt = now;
      } else {
        if (wifiReconnectAttempts > 0 && (now - wifiLastConnectAttempt > 300000)) {
          wifiReconnectAttempts = 0;
        }
      }
      break;

    case WIFI_STATE_DISCONNECTED:
      {
        uint8_t maxShift = min(wifiReconnectAttempts, (uint8_t)4);
        uint32_t backoffDelay = WIFI_RECONNECT_DELAY * (1 << maxShift);
        if (now - wifiLastConnectAttempt > backoffDelay) {
          wifiState = WIFI_STATE_IDLE;
        }
      }
      break;
  }
}

// ============================================================================
// Task Monitoring Helpers
// ============================================================================

String getTaskStateName(eTaskState s) {
  switch (s) {
    case eRunning: return "RUNNING";
    case eReady: return "READY";
    case eBlocked: return "BLOCKED";
    case eSuspended: return "SUSPENDED";
    case eDeleted: return "DELETED";
    default: return "UNKNOWN";
  }
}

String getStackHealth(uint32_t hwm) {
  if (hwm > 1500) return "good";
  if (hwm > 800) return "ok";
  if (hwm > 300) return "low";
  return "critical";
}

String getAffinityString(BaseType_t affinity) {
  return (affinity == tskNO_AFFINITY) ? "ANY" : String(affinity);
}

static inline BaseType_t getSafeAffinity(TaskHandle_t handle) {
#if CONFIG_FREERTOS_UNICORE
  (void)handle;
  return 0;
#else
  if (handle == nullptr) return tskNO_AFFINITY;
  return xTaskGetAffinity(handle);
#endif
}

// ============================================================================
// Per-Core Task Monitoring
// ============================================================================

void updateTaskMonitoring() {
  if (millis() - lastTaskSample < 500) return;
  lastTaskSample = millis();

  TaskStatus_t statusArray[MAX_TASKS_MONITORED];
  UBaseType_t numTasks = uxTaskGetSystemState(statusArray, MAX_TASKS_MONITORED, NULL);
  if (numTasks == 0) return;

  for (int c = 0; c < NUM_CORES; c++) {
    coreRuntime[c].totalRuntime100ms = 0;
    coreRuntime[c].taskCount = 0;
    coreRuntime[c].cpuPercentTotal = 0;
  }
  noAffinityRuntime100ms = 0;

  for (uint8_t j = 0; j < numTasks; j++) {
    BaseType_t affinity = getSafeAffinity(statusArray[j].xHandle);
    uint32_t runtime = statusArray[j].ulRunTimeCounter;

    if (affinity == tskNO_AFFINITY) {
      noAffinityRuntime100ms += (uint64_t)runtime;
    } else if (affinity >= 0 && affinity < NUM_CORES) {
      coreRuntime[affinity].totalRuntime100ms += (uint64_t)runtime;
      coreRuntime[affinity].taskCount++;
    }
  }

  uint64_t coreDelta[2] = { 0, 0 };
  for (int c = 0; c < NUM_CORES; c++) {
    coreDelta[c] = coreRuntime[c].totalRuntime100ms - coreRuntime[c].prevTotalRuntime100ms;
    if (coreDelta[c] == 0) coreDelta[c] = 1;
  }

  if (!statsInitialized) {
    taskCount = min(numTasks, (UBaseType_t)MAX_TASKS_MONITORED);
    for (uint8_t i = 0; i < taskCount; i++) {
      taskData[i].name = String(statusArray[i].pcTaskName);
      taskData[i].priority = statusArray[i].uxCurrentPriority;
      taskData[i].state = statusArray[i].eCurrentState;
      taskData[i].runtime = statusArray[i].ulRunTimeCounter;
      taskData[i].prevRuntime = statusArray[i].ulRunTimeCounter;
      taskData[i].runtimeAccumUs = 0;
      taskData[i].stackHighWater = statusArray[i].xHandle ? uxTaskGetStackHighWaterMark(statusArray[i].xHandle) : 0;
      taskData[i].stackHealth = getStackHealth(taskData[i].stackHighWater);
      taskData[i].cpuPercent = 0;
      taskData[i].handle = statusArray[i].xHandle;
      taskData[i].coreAffinity = getSafeAffinity(statusArray[i].xHandle);
    }
    for (int c = 0; c < NUM_CORES; c++) {
      coreRuntime[c].prevTotalRuntime100ms = coreRuntime[c].totalRuntime100ms;
    }
    statsInitialized = true;
    return;
  }

  for (uint8_t i = 0; i < taskCount; i++) {
    bool found = false;
    for (uint8_t j = 0; j < numTasks; j++) {
      if (taskData[i].handle == statusArray[j].xHandle) {
        uint32_t currentRuntime100ms = statusArray[j].ulRunTimeCounter;

        uint32_t taskDelta;
        if (currentRuntime100ms >= taskData[i].prevRuntime) {
          taskDelta = currentRuntime100ms - taskData[i].prevRuntime;
        } else {
          taskDelta = (0xFFFFFFFF - taskData[i].prevRuntime) + currentRuntime100ms + 1;
        }

        taskData[i].runtimeAccumUs += (uint64_t)taskDelta;

        BaseType_t affinity = getSafeAffinity(statusArray[j].xHandle);
        taskData[i].coreAffinity = affinity;

        if (affinity == tskNO_AFFINITY) {
          noAffinityAccumUs += taskDelta;
        } else if (affinity >= 0 && affinity < NUM_CORES) {
          coreAccumUs[affinity] += taskDelta;
        }

        if (affinity == tskNO_AFFINITY) {
          uint64_t totalCoreDelta = 0;
          for (int c = 0; c < NUM_CORES; c++) totalCoreDelta += coreDelta[c];
          if (totalCoreDelta > 0) {
            uint64_t percentage = ((uint64_t)taskDelta * 100ULL) / totalCoreDelta;
            taskData[i].cpuPercent = (percentage > 100) ? 100 : (uint8_t)percentage;
          } else {
            taskData[i].cpuPercent = 0;
          }
        } else if (affinity >= 0 && affinity < NUM_CORES) {
          if (coreDelta[affinity] > 0) {
            uint64_t percentage = ((uint64_t)taskDelta * 100ULL) / coreDelta[affinity];
            taskData[i].cpuPercent = (percentage > 100) ? 100 : (uint8_t)percentage;
          } else {
            taskData[i].cpuPercent = 0;
          }
          coreRuntime[affinity].cpuPercentTotal += taskData[i].cpuPercent;
        } else {
          taskData[i].cpuPercent = 0;
        }

        taskData[i].priority = statusArray[j].uxCurrentPriority;
        taskData[i].state = statusArray[j].eCurrentState;
        taskData[i].runtime = currentRuntime100ms;
        taskData[i].prevRuntime = currentRuntime100ms;
        taskData[i].stackHighWater = statusArray[j].xHandle ? uxTaskGetStackHighWaterMark(statusArray[j].xHandle) : 0;
        taskData[i].stackHealth = getStackHealth(taskData[i].stackHighWater);
        taskData[i].handle = statusArray[j].xHandle;
        found = true;
        break;
      }
    }
    if (!found) {
      taskData[i].cpuPercent = 0;
      taskData[i].state = eDeleted;
    }
  }

  for (uint8_t j = 0; j < numTasks && taskCount < MAX_TASKS_MONITORED; j++) {
    bool exists = false;
    for (uint8_t i = 0; i < taskCount; i++) {
      if (taskData[i].handle == statusArray[j].xHandle) {
        exists = true;
        break;
      }
    }
    if (!exists) {
      taskData[taskCount].name = String(statusArray[j].pcTaskName);
      taskData[taskCount].priority = statusArray[j].uxCurrentPriority;
      taskData[taskCount].state = statusArray[j].eCurrentState;
      taskData[taskCount].runtime = statusArray[j].ulRunTimeCounter;
      taskData[taskCount].prevRuntime = statusArray[j].ulRunTimeCounter;
      taskData[taskCount].runtimeAccumUs = 0;
      taskData[taskCount].stackHighWater = statusArray[j].xHandle ? uxTaskGetStackHighWaterMark(statusArray[j].xHandle) : 0;
      taskData[taskCount].stackHealth = getStackHealth(taskData[taskCount].stackHighWater);
      taskData[taskCount].cpuPercent = 0;
      taskData[taskCount].handle = statusArray[j].xHandle;
      taskData[taskCount].coreAffinity = getSafeAffinity(statusArray[j].xHandle);
      taskCount++;
    }
  }

  for (int c = 0; c < NUM_CORES; c++) {
    coreRuntime[c].prevTotalRuntime100ms = coreRuntime[c].totalRuntime100ms;
  }
}

// ============================================================================
// API Endpoints
// ============================================================================

