AlexLeeChan/esp32template/esp32template v1.ino
static void handleApiStatus() {
  DynamicJsonDocument doc(1536);
  doc["ble"] = bleDeviceConnected;

  bool connected = (WiFi.status() == WL_CONNECTED);
  doc["connected"] = connected;

  if (connected) {
    doc["ip"] = WiFi.localIP().toString();
    doc["rssi"] = WiFi.RSSI();
    JsonObject net = doc.createNestedObject("net");
    net["ssid"] = WiFi.SSID();
    net["dhcp"] = netConfig.useDHCP;
    if (!netConfig.useDHCP) {
      net["static_ip"] = netConfig.staticIP.toString();
      net["gateway"] = netConfig.gateway.toString();
      net["subnet"] = netConfig.subnet.toString();
      net["dns"] = netConfig.dns.toString();
    }
  }

  doc["uptime_ms"] = millis();
  doc["heap_free"] = ESP.getFreeHeap();
  doc["heap_total"] = ESP.getHeapSize();
  doc["heap_max_alloc"] = ESP.getMaxAllocHeap();
  doc["core0_load"] = coreLoadPct[0];
  doc["core1_load"] = coreLoadPct[1];
  doc["chip_model"] = ESP.getChipModel();
  doc["cpu_freq"] = ESP.getCpuFreqMHz();
  doc["num_cores"] = NUM_CORES;
  doc["temp_c"] = getInternalTemperatureC();

#if ENABLE_OTA
  JsonObject ota = doc.createNestedObject("ota");
  ota["enabled"] = true;
  if (xSemaphoreTake(otaMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
    ota["available"] = otaStatus.available;
    ota["state"] = (uint8_t)otaStatus.state;
    xSemaphoreGive(otaMutex);
  }
#else
  JsonObject ota = doc.createNestedObject("ota");
  ota["enabled"] = false;
#endif

  MemoryInfo memInfo = getMemoryInfo();
  JsonObject memory = doc.createNestedObject("memory");
  memory["flash_mb"] = memInfo.flashSizeMB;
  memory["psram_total"] = memInfo.psramSizeBytes;
  memory["psram_free"] = memInfo.psramFreeBytes;
  memory["has_psram"] = memInfo.hasPsram;

  JsonObject biz = doc.createNestedObject("biz");
  biz["running"] = (gBizState == BIZ_RUNNING);
  if (execQ) biz["queue"] = uxQueueMessagesWaiting(execQ);
  biz["processed"] = bizProcessed;

  JsonObject cores = doc.createNestedObject("cores");
  for (int c = 0; c < NUM_CORES; c++) {
    JsonObject core = cores.createNestedObject(String(c));
    core["tasks"] = coreRuntime[c].taskCount;
    core["load_pct"] = coreLoadPct[c];
    core["cpu_total"] = coreRuntime[c].cpuPercentTotal;
  }

  String output;
  output.reserve(1024);
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

void sendTaskMonitoring() {
  DynamicJsonDocument doc(5120);
  JsonArray arr = doc.createNestedArray("tasks");

  uint8_t activeTaskCount = 0;
  for (uint8_t i = 0; i < taskCount; i++) {
    if (taskData[i].state == eDeleted) continue;
    activeTaskCount++;

    JsonObject t = arr.createNestedObject();
    t["name"] = taskData[i].name;
    t["priority"] = taskData[i].priority;
    t["state"] = getTaskStateName(taskData[i].state);
    t["runtime"] = (uint64_t)taskData[i].runtimeAccumUs / 1000000ULL;
    t["stack_hwm"] = taskData[i].stackHighWater;
    t["stack_health"] = taskData[i].stackHealth;
    t["cpu_percent"] = taskData[i].cpuPercent;
    t["core"] = getAffinityString(taskData[i].coreAffinity);
  }

  doc["task_count"] = activeTaskCount;
  doc["uptime_ms"] = millis();

  JsonObject coreSummary = doc.createNestedObject("core_summary");
  for (int c = 0; c < NUM_CORES; c++) {
    JsonObject core = coreSummary.createNestedObject(String(c));
    core["tasks"] = coreRuntime[c].taskCount;
    core["cpu_total"] = coreRuntime[c].cpuPercentTotal;
    core["load"] = coreLoadPct[c];
  }

  String out;
  out.reserve(5120);
  serializeJson(doc, out);
  server.send(200, "application/json", out);
}

// ============================================================================
// REST Handlers
// ============================================================================

void hNetworkConfig() {
  if (isOtaActive()) {
    sendBusyJson(server);
    return;
  }
  if (!server.hasArg("plain")) {
    server.send(400, "application/json", "{\"err\":\"no body\"}");
    return;
  }

  DynamicJsonDocument doc(512);
  DeserializationError error = deserializeJson(doc, server.arg("plain"));
  if (error) {
    server.send(400, "application/json", "{\"err\":\"bad json\"}");
    return;
  }

  const char* ssid = doc["ssid"] | "";
  const char* pass = doc["pass"] | "";
  bool dhcp = doc["dhcp"] | true;

  if (strlen(ssid) == 0) {
    server.send(400, "application/json", "{\"err\":\"ssid required\"}");
    return;
  }

  if (strlen(ssid) > 0) {
    prefs.putString("wifi_ssid", ssid);
    if (strlen(pass) > 0) {
      prefs.putString("wifi_pass", pass);
    }
  }

  netConfig.useDHCP = dhcp;
  if (!dhcp) {
    if (doc.containsKey("static_ip")) netConfig.staticIP = parseIP(String(doc["static_ip"].as<const char*>()));
    if (doc.containsKey("gateway")) netConfig.gateway = parseIP(String(doc["gateway"].as<const char*>()));
    if (doc.containsKey("subnet")) netConfig.subnet = parseIP(String(doc["subnet"].as<const char*>()));
    if (doc.containsKey("dns")) netConfig.dns = parseIP(String(doc["dns"].as<const char*>()));
    saveNetworkConfig();
  }

  wifiManualDisconnect = false;
  wifiReconnectAttempts = 0;
  wifiState = WIFI_STATE_IDLE;

  StaticJsonDocument<128> resp;
  resp["msg"] = "Saved, reconnecting...";
  String out;
  serializeJson(resp, out);
  server.send(200, "application/json", out);
}

void hExec() {
  if (isOtaActive()) {
    sendBusyJson(server);
    return;
  }
  if (!server.hasArg("plain")) {
    server.send(400, "application/json", "{\"err\":\"no body\"}");
    return;
  }

  StaticJsonDocument<512> doc;
  DeserializationError error = deserializeJson(doc, server.arg("plain"));
  if (error) {
    server.send(400, "application/json", "{\"err\":\"parse error\"}");
    return;
  }

  String cmdStr = doc["cmd"] | "";
  cmdStr.trim();

  // --- DEBUG ---
  Serial.printf("\n[hExec] Received command: '%s'\n", cmdStr.c_str());
  // --- END DEBUG ---
  
  //
  // "if (cmdStr.equalsIgnoreCase("reset"))" block is REMOVED.
  // All commands now go to the queue.
  //

  size_t cmdLen = cmdStr.length();
  if (cmdLen == 0 || cmdLen >= MAX_MSG_SIZE) {
    Serial.println("[hExec] Command is empty or too long. Aborting.");
    server.send(400, "application/json", "{\"err\":\"invalid cmd\"}");
    return;
  }

  ExecMessage* msg = allocMessage();
  if (!msg) {
    Serial.println("[hExec] Message pool is full. Aborting.");
    server.send(503, "application/json", "{\"err\":\"pool full\"}");
    return;
  }

  memcpy(msg->payload, cmdStr.c_str(), cmdLen);
  msg->payload[cmdLen] = '\0';
  msg->length = cmdLen;

