AlexLeeChan/esp32template/esp32template v1.ino
  if (execQ && xQueueSend(execQ, &msg, 0) == pdTRUE) {
    // --- DEBUG ---
    Serial.printf("[hExec] Command '%s' successfully sent to bizTask queue.\n", msg->payload);
    // --- END DEBUG ---
    
    // Give a specific response if a reboot command is queued
    String lowerCmd = cmdStr;
    lowerCmd.toLowerCase();
    if (lowerCmd.equals("reset") || lowerCmd.equals("reboot")) {
      server.send(200, "application/json", "{\"msg\":\"Reboot command queued\"}");
    } else {
      server.send(200, "application/json", "{\"msg\":\"queued\"}");
    }
  } else {
    // --- DEBUG ---
    Serial.println("[hExec] FAILED to send command to bizTask queue.");
    // --- END DEBUG ---
    freeMessage(msg);
    server.send(503, "application/json", "{\"err\":\"queue send failed\"}");
  }
}

void hBizStart() {
  if (isOtaActive()) {
    sendBusyJson(server);
    return;
  }
  gBizState = BIZ_RUNNING;
  server.send(200, "application/json", "{\"msg\":\"started\"}");
}

void hBizStop() {
  if (isOtaActive()) {
    sendBusyJson(server);
    return;
  }
  gBizState = BIZ_STOPPED;
  server.send(200, "application/json", "{\"msg\":\"stopped\"}");
}

// ============================================================================
// HTML Dashboard
// ============================================================================

static const char INDEX_HTML_PART1[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>ESP32(x) Controller</title>
<style>
* {box-sizing:border-box;margin:0;padding:0}
body {font-family:'Segoe UI',Tahoma,Geneva,Verdana,sans-serif;background:#0d1117;color:#c9d1d9;min-height:100vh;padding:8px}
.container {max-width:1400px;margin:0 auto}
h1 {text-align:center;margin-bottom:12px;font-size:1.8em;background:linear-gradient(90deg,#58a6ff,#bc8cff);-webkit-background-clip:text;-webkit-text-fill-color:transparent;background-clip:text}
.card {background:#161b22;border:1px solid #30363d;border-radius:8px;padding:12px;margin-bottom:10px;box-shadow:0 4px 8px rgba(0,0,0,0.4)}
.card h3 {margin-bottom:8px;color:#58a6ff;font-size:1.1em;border-bottom:1px solid #21262d;padding-bottom:6px}
.card.condensed { padding: 8px; }
.card.condensed h3 { font-size: 1.05em; margin-bottom: 6px; padding-bottom: 4px; }
.card.condensed .form-group { margin-bottom: 6px; }
.card.condensed .form-group label { margin-bottom: 2px; font-size: 0.8em; }
.card.condensed input[type="text"], .card.condensed input[type="password"] { padding: 6px; font-size: 0.85em; }
.card.condensed .btn { padding: 6px 10px; font-size: 0.85em; }
.card.condensed .alert { padding: 6px; margin-bottom: 6px; font-size: 0.8em; }
.card.condensed .pill { padding: 3px 8px; font-size: 0.75em; }
.card.condensed .row { margin-bottom: 4px; }
h4 {color:#58a6ff;font-size:1em;margin-bottom:6px}
.row {display:flex;gap:6px;flex-wrap:wrap;align-items:center;margin-bottom:6px}
.pill {background:#21262d;padding:4px 10px;border-radius:12px;font-size:0.8em;white-space:nowrap;border:1px solid #30363d}
.core-badge {padding:3px 8px;border-radius:10px;font-size:0.75em;font-weight:600}
.core-0 {background:#1f6feb;color:#fff}
.core-1 {background:#9e6a03;color:#fff}
.core-any {background:#6e7681;color:#fff}
.status-dot {display:inline-block;width:10px;height:10px;border-radius:50%;margin-right:6px}
.status-dot.on {background:#00ff41;box-shadow:0 0 10px 2px #00ff41}
.status-dot.off {background:#6e7681}
input[type="text"],input[type="password"],textarea {width:100%;padding:8px;border:1px solid #30363d;border-radius:4px;font-size:0.9em;margin-bottom:6px;background:#0d1117;color:#c9d1d9}
textarea {resize:vertical;font-family:monospace}
button,.btn {padding:8px 16px;border:none;border-radius:4px;font-size:0.9em;cursor:pointer;transition:all 0.3s;font-weight:500}
.btn.primary {background:#238636;color:#fff}
.btn.primary:hover {background:#2ea043}
.btn.secondary {background:#21262d;color:#c9d1d9;border:1px solid #30363d}
.btn.danger {background:#da3633;color:#fff}
.small {font-size:0.75em;color:#8b949e;font-weight:normal}
pre {background:#0d1117;color:#c9d1d9;padding:10px;border-radius:4px;overflow-x:auto;font-size:0.8em;border:1px solid #30363d}
.form-group {margin-bottom:8px}
.form-group label {display:block;margin-bottom:3px;color:#8b949e;font-size:0.85em}
.grid {display:grid;grid-template-columns:repeat(auto-fit,minmax(280px,1fr));gap:10px}
.task-table {width:100%;border-collapse:collapse;margin-top:6px;font-size:0.85em}
.task-table th {background:#21262d;color:#c9d1d9;padding:6px 8px;text-align:left;font-size:0.85em;border:1px solid #30363d}
.task-table td {padding:5px 8px;border:1px solid #30363d;font-size:0.8em}
.task-table tr:hover {background:#161b22}
.task-name {font-weight:bold;font-family:monospace;color:#58a6ff;font-size:0.8em}
.task-state {padding:3px 6px;border-radius:3px;font-size:0.75em;font-weight:bold}
.state-running {background:#238636;color:#fff}
.state-ready {background:#1f6feb;color:#fff}
.state-blocked {background:#9e6a03;color:#fff}
.health-good {color:#3fb950;font-weight:bold}
.health-ok {color:#58a6ff;font-weight:bold}
.health-low {color:#d29922;font-weight:bold}
.health-critical {color:#f85149;font-weight:bold}
.progress-bar {width:100%;height:6px;background:#21262d;border-radius:3px;overflow:hidden;border:1px solid #30363d}
.progress-fill {height:100%;background:linear-gradient(90deg,#238636,#3fb950);transition:width 0.3s}
.cpu-badge {display:inline-block;padding:2px 5px;border-radius:3px;font-size:0.7em;font-weight:bold}
.cpu-low {background:#238636;color:#fff}
.cpu-med {background:#d29922;color:#000}
.cpu-high {background:#da3633;color:#fff}
.alert {padding:8px;border-radius:4px;margin-bottom:8px;border-left:3px solid;font-size:0.85em}
.alert.success {background:#0d1117;border-color:#238636;color:#3fb950}
.alert.error {background:#0d1117;border-color:#da3633;color:#f85149}
.alert.info {background:#0d1117;border-color:#1f6feb;color:#58a6ff}
.task-table-wrapper {
  max-height: 500px;
  overflow-y: auto;
  overflow-x: auto;
  margin-top: 6px;
  border: 1px solid #30363d;
  border-radius: 4px;
}
.task-table {
  width:100%;
  border-collapse:collapse;
  font-size:0.85em;
  margin:0;
}
.task-table thead {
  position: sticky;
  top: 0;
  z-index: 10;
}
</style>
</head>
<body>
<div class="container">
<h1>ESP32(x) Controller</h1>
<div class="card">
 <h3>System Status <span class="small">Active state</span></h3>
 <div class="row">
  <div><span class="status-dot off" id="bleDot"></span><span>BLE</span></div>
  <div><span class="status-dot off" id="wifiDot"></span><span>WiFi</span></div>
  <div class="pill" id="ipInfo">IP: -</div>
  <div class="pill" id="rssiInfo">RSSI: --</div>
  <div class="pill">Up: <span id="upt">--:--:--</span></div>
  <div class="pill">Free Heap: <span id="heap">--</span>/<span id="heapTot">--</span></div>
  <div class="pill">Temp: <span id="tempC">--</span></div>
  <div class="pill"><span class="core-badge core-0">C0</span> <span id="c0">-</span>% (<span id="c0Tasks">-</span> tasks)</div>
  <div class="pill" id="c1pill"><span class="core-badge core-1">C1</span> <span id="c1">-</span>% (<span id="c1Tasks">-</span> tasks)</div>
  <div class="pill">Tasks: <span id="taskCount">-</span></div>
  <div class="pill"><span id="chip">-</span> @ <span id="cpuFreq">-</span>MHz</div>
  <div class="pill">Flash: <span id="flashSize">--</span>MB</div>
  <div class="pill" id="psramPill" style="display:none">PSRAM: <span id="psramUsed">--</span>/<span id="psramTotal">--</span></div>
 </div>
</div>
)rawliteral";

