AlexLeeChan/esp32template/esp32template v1.ino
static const char INDEX_HTML_BIZ_CARD[] PROGMEM = R"rawliteral(
<div class="card condensed">
 <h3>Business Module</h3>
 <div id="bizStatus" class="alert info">Status: <span id="bizState">Loading...</span></div>
 <div class="row">
  <button class="btn primary" onclick="startBiz()">Start</button>
  <button class="btn danger" onclick="stopBiz()">Stop</button>
  <div class="pill">Q:<span id="bizQueue">-</span> | Proc:<span id="bizProcessed">-</span></div>
 </div>
</div>
)rawliteral";

static const char INDEX_HTML_CMD_CARD[] PROGMEM = R"rawliteral(
<div class="card condensed">
 <h3>Command Exec</h3>
 <div class="form-group">
  <input type="text" id="execCmd" placeholder="Enter command...">
 </div>
 <button class="btn primary" onclick="submitCommand()">Execute</button>
 <div id="execResult"></div>
</div>
)rawliteral";

static const char INDEX_HTML_WIFI_CARD[] PROGMEM = R"rawliteral(
<div class="card condensed">
 <h3>WiFi Config</h3>
 <div class="grid">
  <div>
   <div class="form-group">
    <label>SSID</label>
    <input type="text" id="wifiSsid" placeholder="Network name">
   </div>
   <div class="form-group">
    <label>Password</label>
    <input type="password" id="wifiPass" placeholder="Password">
   </div>
   <div class="form-group">
    <label><input type="checkbox" id="wifiDhcp" checked> DHCP</label>
   </div>
  </div>
  <div id="staticIpFields" style="display:none">
   <div style="display:grid;grid-template-columns:1fr 1fr;gap:6px">
    <div class="form-group" style="margin-bottom:4px">
     <label style="font-size:0.75em">Static IP</label>
     <input type="text" id="staticIp" placeholder="192.168.1.100" style="padding:5px;font-size:0.8em">
    </div>
    <div class="form-group" style="margin-bottom:4px">
     <label style="font-size:0.75em">Gateway</label>
     <input type="text" id="gateway" placeholder="192.168.1.1" style="padding:5px;font-size:0.8em">
    </div>
    <div class="form-group" style="margin-bottom:4px">
     <label style="font-size:0.75em">Subnet</label>
     <input type="text" id="subnet" placeholder="255.255.255.0" style="padding:5px;font-size:0.8em">
    </div>
    <div class="form-group" style="margin-bottom:4px">
     <label style="font-size:0.75em">DNS</label>
     <input type="text" id="dns" placeholder="8.8.8.8" style="padding:5px;font-size:0.8em">
    </div>
   </div>
  </div>
 </div>
 <button class="btn primary" onclick="saveNetwork()">Save & Connect</button>
 <div id="networkResult"></div>
</div>
)rawliteral";

#if DEBUG_MODE
static const char INDEX_HTML_TASKS[] PROGMEM = R"rawliteral(
<div class="card">
 <h3>Tasks <span class="small">Per-Core CPU%</span></h3>
 <div id="taskMonitor"><p style="text-align:center;color:#8b949e;padding:12px">Loading...</p></div>
</div>
)rawliteral";
#endif


#if ENABLE_OTA
static const char INDEX_HTML_OTA[] PROGMEM = R"rawliteral(
<div class="card condensed">
 <h3>OTA Firmware Update</h3>
 <div id="otaAvailable" style="display:none">
  <div class="form-group">
   <label>Firmware URL</label>
   <input type="text" id="otaUrl" placeholder="http://example.com/firmware.bin">
  </div>
   <div class="row" style="font-size: 0.9em; gap: 8px;">
     <style>#otaAvailable .pill strong { color: #58a6ff; }</style>
     <div class="pill">Free Space for OTA: <strong id="freeSpace">-</strong></div>
  </div>
  <div class="row">
   <button class="btn primary" id="otaUpdateBtn" onclick="startOTAUpdate()">Start Update</button>
  </div>
  <div id="otaUpdateResult" style="margin-top: 8px;"></div>
 </div>
 <div id="otaNotAvailable" style="display:none">
   <p style="color:#f85149;font-size:0.9em;">OTA updates are not available (no 'ota' partition found).</p>
 </div>
</div>
)rawliteral";
#endif

static const char INDEX_HTML_PART2[] PROGMEM = R"rawliteral(
</div>
<script>
const I=id=>document.getElementById(id);
let otaInterval = null;

async function refreshOTA(){
  const j = await api('/api/ota/status');
  if(j.error)return;

  const otaAvail = document.getElementById('otaAvailable');
  const otaNotAvail = document.getElementById('otaNotAvailable');
  
  if(!j.available){
    if(otaAvail) otaAvail.style.display = 'none';
    if(otaNotAvail) otaNotAvail.style.display = 'block';
    return;
  }

  if(otaAvail) otaAvail.style.display = 'block';
  if(otaNotAvail) otaNotAvail.style.display = 'none';

  // We only update free space and check if the reset button is needed
  if(j.free_sketch_space) I('freeSpace').textContent = fmB(j.free_sketch_space);
  
  const otaStatusEl = I('otaUpdateResult');
  if (j.state === 5) { // 5 is OTA_FAILED
    if (otaStatusEl) otaStatusEl.innerHTML = `<div class="alert error">Failed: ${j.error || 'Unknown'}. <a href="#" onclick="resetOTA()">Reset?</a></div>`;
  }
}

async function startOTAUpdate(){
  const url = I('otaUrl').value.trim();
  if(!url){ alert('Enter firmware URL'); return; }
  if(!url.startsWith('http')){ alert('URL must start with http:// or https://'); return; }
  if(!confirm('Start OTA update? The device will reboot after a successful update.')){ return; }
  
  const res = I('otaUpdateResult');
  const r = await api('/api/ota/update','POST',{url});
  
  if(r.error || r.err){
     const msg = (r.error || r.err);
     if (res) res.innerHTML = `<div class="alert error">Error: ${msg}</div>`;
  } else {
     if(res) res.innerHTML = `<div class="alert success">Update started! Reloading to show progress...</div>`;
     // Reload the page. The main 'refresh' function will catch 'ota_active'
     // and load the 'busy' page for us.
     setTimeout(() => { location.reload(); }, 1000);
  }
}

async function resetOTA(){
  const res = I('otaUpdateResult');
  if(res) res.innerHTML = '';
  const r = await api('/api/ota/reset','POST');
  if(!r.error){
    refreshOTA();
  }
}
async function api(path,method='GET',body=null){
 try{
  const opts={method};
  if(body){opts.headers={'Content-Type':'application/json'};opts.body=JSON.stringify(body);}
  const r=await fetch(path,opts);
  if(r.status === 503) {
   console.warn('Server is busy (OTA in progress).');
   return { error: 'ota_active' };
  }
   if(!r.ok) {
     const errText = await r.text();
     return {error: `HTTP ${r.status}: ${errText}`};
   }
  return await r.json();
 }catch(e){return{error:e.message}}
}
function fmU(ms){const s=Math.floor(ms/1000),h=Math.floor(s/3600),m=Math.floor((s%3600)/60),ss=s%60;return`${String(h).padStart(2,'0')}:${String(m).padStart(2,'0')}:${String(ss).padStart(2,'0')}`}
function fmB(b){if(b<1024)return`${b}B`;if(b<1048576)return`${(b/1024).toFixed(1)}KB`;return`${(b/1048576).toFixed(2)}MB`;}
function cpuCls(v){return v<30?'cpu-low':v<70?'cpu-med':'cpu-high'}
function healthCls(v){return'health-'+v}
function stCls(v){return'state-'+v.toLowerCase()}
function coreCls(c){if(c==='ANY')return'core-any';if(c==='0')return'core-0';if(c==='1')return'core-1';return'core-any';}
I('wifiDhcp').addEventListener('change',()=>{I('staticIpFields').style.display=I('wifiDhcp').checked?'none':'block';});
async function startBiz(){const r=await api('/api/biz/start','POST');if(r.error)return;if(!r.error){I('bizState').textContent='RUNNING';refresh();}}
async function stopBiz(){const r=await api('/api/biz/stop','POST');if(r.error)return;if(!r.error){I('bizState').textContent='STOPPED';refresh();}}

