AlexLeeChan/esp32template/esp32template v1.ino
// Renamed to submitCommand to avoid browser conflict
async function submitCommand(){
 const cmd=I('execCmd').value.trim();
 if(!cmd){alert('Enter a command');return;}
 const r=await api('/api/exec','POST',{cmd});
 if(r.error)return;
 const res=I('execResult');
 if(r.error||r.err){res.innerHTML='<div class="alert error">'+(r.error||r.err)+'</div>';}
 else{res.innerHTML='<div class="alert success">'+r.msg+'</div>';I('execCmd').value='';}
 setTimeout(()=>res.innerHTML='',3000);
}

async function saveNetwork(){
 const ssid=I('wifiSsid').value.trim();
 const pass=I('wifiPass').value;
 const dhcp=I('wifiDhcp').checked;
 if(!ssid){alert('Enter SSID');return;}
 const body={ssid,pass,dhcp};
 if(!dhcp){
  body.static_ip=I('staticIp').value;
  body.gateway=I('gateway').value;
  body.subnet=I('subnet').value;
  body.dns=I('dns').value;
 }
 const r=await api('/api/network','POST',body);
 if(r.error)return;
 const res=I('networkResult');
 if(r.error||r.err){res.innerHTML='<div class="alert error">'+(r.error||r.err)+'</div>';}
 else{res.innerHTML='<div class="alert success">'+r.msg+'</div>';}
 setTimeout(()=>res.innerHTML='',5000);
}
async function refreshTasks(){
 const j=await api('/api/tasks');
 if(j.error)return;
 
 I('taskCount').textContent=j.task_count||'-';
 if(j.core_summary){
  if(j.core_summary['0']){
  I('c0Tasks').textContent=j.core_summary['0'].tasks||'0';
  }
  if(j.core_summary['1']){
  I('c1Tasks').textContent=j.core_summary['1'].tasks||'0';
  }
 }
 
 const taskMonitorEl = I('taskMonitor');
 if(!taskMonitorEl) return;
 
 if(!j.tasks){taskMonitorEl.innerHTML='<p style="text-align:center;color:#8b949e">No tasks</p>';return;}
 j.tasks.sort((a,b)=>(b.runtime||0)-(a.runtime||0));
 let h='<div class="task-table-wrapper"><table class="task-table"><thead><tr><th>Task</th><th>Core</th><th>Pri</th><th>Stack</th><th>State</th><th>CPU%</th><th>Runtime</th></tr></thead><tbody>';
 j.tasks.forEach(t=>{
  const cpuPct = Math.min(100, t.cpu_percent || 0);
  h+=`<tr>
    <td class="task-name">${t.name}</td>
    <td><span class="core-badge ${coreCls(t.core)}">${t.core}</span></td>
    <td>${t.priority}</td>
    <td><span class="${healthCls(t.stack_health)}">${t.stack_hwm}</span></td>
    <td><span class="task-state ${stCls(t.state)}">${t.state}</span></td>
    <td><span class="cpu-badge ${cpuCls(cpuPct)}">${cpuPct}%</span>
    <div class="progress-bar"><div class="progress-fill" style="width:${cpuPct}%"></div></div></td>
    <td>${fmU((t.runtime||0)*1000)}</td>
  </tr>`;
 });
 h+='</tbody></table></div>';
 taskMonitorEl.innerHTML=h;
}
async function refresh(){
 const j=await api('/api/status');
 if(j.error) {
  if (j.error === 'ota_active') {
    // This is the key: if the api call fails with 'ota_active',
    // we immediately reload to show the 'busy' page.
    location.reload();
  }
  return;
 }
 if(j.ota_active) {
  // If the server is somehow still responding AND says ota_active,
  // reload to get to the 'busy' page.
  location.reload();
  return;
 }
 I('bleDot').classList.toggle('on',!!j.ble);
 I('wifiDot').classList.toggle('on',!!j.connected);
 I('ipInfo').textContent=`IP: ${j.ip||'-'}`;
 I('rssiInfo').textContent=`RSSI: ${j.rssi||'--'}`;
 I('upt').textContent=fmU(j.uptime_ms||0);
 I('heap').textContent=fmB(j.heap_free||0);
 I('heapTot').textContent=fmB(j.heap_total||0);
 I('c0').textContent=j.core0_load??'-';
 I('c1').textContent=j.core1_load??'-';
 I('chip').textContent=j.chip_model||'-';
 I('cpuFreq').textContent=j.cpu_freq||'-';
 if(j.temp_c===null||j.temp_c===undefined){I('tempC').textContent='n/a';}
 else{I('tempC').textContent=j.temp_c.toFixed?j.temp_c.toFixed(1)+'C':j.temp_c+'C';}
 
 if(j.memory){
  I('flashSize').textContent=j.memory.flash_mb||'--';
  if(j.memory.has_psram){
  I('psramPill').style.display='inline-block';
  const psramUsed = (j.memory.psram_total - j.memory.psram_free);
  I('psramUsed').textContent=fmB(psramUsed);
  I('psramTotal').textContent=fmB(j.memory.psram_total);
  }else{
  I('psramPill').style.display='none';
  }
 }
 
 if(j.num_cores===1){I('c1pill').style.display='none';}else{I('c1pill').style.display='inline-block';}
 if(j.biz){
  I('bizState').textContent=j.biz.running?'RUNNING':'STOPPED';
  I('bizQueue').textContent=j.biz.queue??'-';
  I('bizProcessed').textContent=j.biz.processed??'-';
 }
}
)rawliteral";

static const char INDEX_HTML_END[] PROGMEM = R"rawliteral(
const refreshInterval = setInterval(refresh,2000);
const taskInterval = setInterval(refreshTasks,3000);
refresh();
refreshTasks();
if(document.getElementById('otaAvailable')){
 otaInterval = setInterval(refreshOTA,2000);
 refreshOTA();
}
I('execCmd').addEventListener('keyup', e => { if (e.key === 'Enter') submitCommand(); });
</script>
</body>
</html>
)rawliteral";

static void register_guarded_routes() {
  server.on("/", HTTP_GET, []() {
    sendIndex_guarded();
  });
  server.on("/api/status", HTTP_GET, []() {
    handleApiStatus_guarded();
  });
  server.on("/api/tasks", HTTP_GET, []() {
    sendTaskMonitoring_guarded();
  });

  server.on("/api/network", HTTP_POST, hNetworkConfig);
  server.on("/api/exec", HTTP_POST, hExec);
  server.on("/api/biz/start", HTTP_POST, hBizStart);
  server.on("/api/biz/stop", HTTP_POST, hBizStop);

#if ENABLE_OTA
  server.on("/api/ota/status", HTTP_GET, handleOTAStatus);
  server.on("/api/ota/update", HTTP_POST, handleOTAUpdate);
  server.on("/api/ota/reset", HTTP_POST, handleOTAReset);
  server.on("/api/ota/info", HTTP_GET, handleOTAInfo);
#endif
  server.onNotFound([]() {
    server.send(404, "application/json", "{\"err\":\"not found\"}");
  });
}


static void sendIndex() {
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", "");

  server.sendContent_P(INDEX_HTML_PART1);
  delay(1);

  server.sendContent_P(PSTR("<div class=\"grid\">"));
  delay(1);

  server.sendContent_P(INDEX_HTML_BIZ_CARD);
  delay(1);
  server.sendContent_P(INDEX_HTML_CMD_CARD);
  delay(1);
  server.sendContent_P(INDEX_HTML_WIFI_CARD);
  delay(1);
#if ENABLE_OTA
  server.sendContent_P(INDEX_HTML_OTA);
  delay(1);
#endif

  server.sendContent_P(PSTR("</div>"));
  delay(1);

#if DEBUG_MODE
  server.sendContent_P(INDEX_HTML_TASKS);
  delay(1);
#endif

