AlexLeeChan/esp32template/esp32template v1.ino
  server.sendContent_P(INDEX_HTML_PART2);
  delay(1);
  server.sendContent_P(INDEX_HTML_END);
  server.client().flush();
  delay(2);
  server.client().stop();
}

void routes() {
  register_guarded_routes();

  if (WiFi.getMode() == WIFI_OFF) {
    WiFi.mode(WIFI_STA);
    delay(100);
  }
  server.begin();
}

// ============================================================================
// RTOS Tasks - WITH GRACEFUL SELF-DELETION AND OTA PROTECTION
// ============================================================================
void systemTask(void* param) {
  esp_task_wdt_add(NULL);
  bool ledState = false;
  uint32_t ledTs = 0;
  pinMode(BLE_LED_PIN, OUTPUT);

  digitalWrite(BLE_LED_PIN, LED_INVERTED ? HIGH : LOW);

  for (;;) {
    esp_task_wdt_reset();

    #if ENABLE_OTA
    // Minimal operation during OTA - don't touch WiFi
    if (otaInProgress) {
      vTaskDelay(pdMS_TO_TICKS(500));
      continue;
    }
    #endif

    if (!isOtaActive()) {
      checkWiFiConnection();
    }

    handleBLEReconnect();
    updateCpuLoad();
    checkTaskStacks();

    if (bleDeviceConnected) {
      uint32_t now = millis();
      if (now - ledTs > BLE_LED_BLINK_MS) {
        ledTs = now;
        ledState = !ledState;
        digitalWrite(BLE_LED_PIN, LED_INVERTED ? (ledState ? LOW : HIGH) : (ledState ? HIGH : LOW));
      }
    } else {
      digitalWrite(BLE_LED_PIN, LED_INVERTED ? HIGH : LOW);
      ledState = false;
    }

    vTaskDelay(pdMS_TO_TICKS(100));
  }
}

void webTask(void* param) {
  esp_task_wdt_add(NULL);
  
  for (;;) {
    // Check if we should exit (for OTA)
    #if ENABLE_OTA
    if (webTaskShouldExit) {
      Serial.println(F("webTask: Received exit signal, cleaning up..."));
      esp_task_wdt_delete(NULL); // Remove from watchdog BEFORE deletion
      webTaskHandle = NULL; // Clear handle
      Serial.println(F("webTask: Exiting"));
      vTaskDelete(NULL); // Delete self
      return;
    }
    #endif
    
    esp_task_wdt_reset();
    server.handleClient();

    if (!isOtaActive()) {
      updateTaskMonitoring();
    } else {
      vTaskDelay(pdMS_TO_TICKS(50));
    }

    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

void bizTask(void* param) {
  esp_task_wdt_add(NULL);
  ExecMessage* msg = nullptr;

  for (;;) {
    // Check if we should exit (for OTA)
    #if ENABLE_OTA
    if (bizTaskShouldExit) {
      Serial.println(F("bizTask: Received exit signal, cleaning up..."));
      esp_task_wdt_delete(NULL); // Remove from watchdog BEFORE deletion
      bizTaskHandle = NULL; // Clear handle
      Serial.println(F("bizTask: Exiting"));
      vTaskDelete(NULL); // Delete self
      return;
    }
    #endif
    
    esp_task_wdt_reset();

    if (gBizState == BIZ_RUNNING && !isOtaActive()) {
      // Actively wait for a message
      if (execQ && xQueueReceive(execQ, &msg, pdMS_TO_TICKS(100)) == pdTRUE) {
        
        Serial.println("\n[bizTask] Received a message from queue.");

        if (msg) {
          
          Serial.printf("[bizTask] Message payload: '%s' (Length: %d)\n", msg->payload, msg->length);
          
          String cmd = String(msg->payload);
          cmd.toLowerCase(); // Make it case-insensitive

          if (cmd.equals("reset") || cmd.equals("reboot")) {
            
            Serial.println("[bizTask] Command MATCHED 'reset' or 'reboot'.");
            Serial.println(F("bizTask: Reboot command received. Restarting in 500ms..."));
            
            freeMessage(msg);
            msg = nullptr;
            vTaskDelay(pdMS_TO_TICKS(500)); // Delay to allow web response to send
            ESP.restart();
            // Will not get here
          
          } else { 
            
            Serial.printf("[bizTask] Command '%s' did NOT match reboot logic. Processing as other command.\n", cmd.c_str());
            
            // This is your "work" for other commands
            vTaskDelay(pdMS_TO_TICKS(50));
            bizProcessed++;
            freeMessage(msg);
            msg = nullptr;
          }
        } else {
            Serial.println("[bizTask] Received a NULL message from queue. This should not happen.");
        }
      }
    } else {
      // Not running, so just idle
      vTaskDelay(pdMS_TO_TICKS(100));
    }
  }
}

// ============================================================================
// Setup & Loop
// ============================================================================

void setup() {
  delay(300);
  Serial.begin(115200);

  esp_log_level_set("wifi", ESP_LOG_WARN);
  esp_log_level_set("dhcpc", ESP_LOG_WARN);
  esp_log_level_set("phy_init", ESP_LOG_WARN);

  esp_task_wdt_deinit();
  esp_task_wdt_config_t wdt_config = {
    .timeout_ms = WDT_TIMEOUT * 1000,
    .idle_core_mask = 0,
    .trigger_panic = true
  };
  esp_task_wdt_init(&wdt_config);

  prefs.begin("esp32_base", false);
  loadNetworkConfig();

#if ESP32_HAS_TEMP
  temperature_sensor_config_t cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
  if (temperature_sensor_install(&cfg, &s_temp_sensor) == ESP_OK) {
    temperature_sensor_enable(s_temp_sensor);
  }
#endif

  initMessagePool();
  initBLE();
  setupWiFi();
  routes();

  execQ = xQueueCreate(MSG_POOL_SIZE, sizeof(ExecMessage*));

  for (int c = 0; c < NUM_CORES; c++) {
    coreRuntime[c].totalRuntime100ms = 0;
    coreRuntime[c].prevTotalRuntime100ms = 0;
    coreRuntime[c].taskCount = 0;
    coreRuntime[c].cpuPercentTotal = 0;
  }

#if NUM_CORES > 1
  xTaskCreatePinnedToCore(bizTask, "biz", 4096, nullptr, 1, &bizTaskHandle, 1);
  xTaskCreatePinnedToCore(webTask, "web", 8192, nullptr, 1, &webTaskHandle, 0);
  xTaskCreatePinnedToCore(systemTask, "sys", 3072, nullptr, 2, &sysTaskHandle, 0);
#else
  xTaskCreate(bizTask, "biz", 4096, nullptr, 1, &bizTaskHandle);
  xTaskCreate(webTask, "web", 8192, nullptr, 1, &webTaskHandle);
  xTaskCreate(systemTask, "sys", 3072, nullptr, 2, &sysTaskHandle);
#endif
}

void loop() {
  vTaskDelete(NULL);
}
